[
    {
        "name": "I12Pro Smart phone 6.6 inch Full Screen Mobile Phone 18MP Front Camera + 48MP Rear Camera Mobile Phone 8GB +512GB flash memory Smart ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4574504441&shopid=369219131",
        "org_price": "172.0-172.0",
        "new_price": "86.0-86.0",
        "desc": "Factory direct sales, better quality but lower price is our target and mission!\nFeature:\n- 6.6 inch Full Display\nThe i12pro delivers the viewingexperience you&apos;ve always wanted, With a massive 93%screen-to-body ratio on a 6.6-inch screen\n\n- 18MP Front CameraClear and Stylish Selfies\nThe i12pro world-leading 18MP front camera turnsyour every selfe into a work of art Experience greaterbrightness, color vibrancy, clarity and dynamic range.even in the dimmest light, Whenever you needit. your i12pro is right there with you, capturing everymoment with crystal-clear precision, Turn your selfiesinto masterpieces and shine in every photo\n\n- Rear HD camera\nThe i12pro features a 48MP camera combination. The main camera sportsa large f/1.8 aperture and 1.28um pixels, This strong combination boosts photosensitibityin backlight or low light, Just point and shoot, and i12pro  will makesure your pictures remain clear and bright\n\n\n- Face Access\n The i12pro also supports facial recognitionUpon activation, i12pro scans your facial features and unlocks instaneouslyAccessing your phone has never been so easy, or so fun\n\n- Powerful Performance\nThe MTK6889 mobile platform with 14mm process technology makesyoung people who love the young and stiand other popular games.The game ison and lower\n\n- Android 10.0\nThe new interactive design makes the operation simple and simple, the use of themobile phone is so simple and straightforward, everything is handy\n- Dual card support T card\nDual card dual standby, card slot does notdistinguish between the main and the deputy, supporting the worlds 50 major communication carrier networks\n\nSpecification:\n1.Model No.:i12pro\n2.Platform : MTK6889\n3.Standby: Dual sim dual standby(A slot support SIM card, another slot support SIM card or TF card)\n4.Screen: 6.6\"2230*1080\n5.Speaker: 1511 Box Speaker\n6.Frequency: GSM850/900/1800/1900MHz, 3G: WCDMA850/2100MHz,4G,5G\n7.Vibration: Support\n8.Colors: Black/Glod/White/Green\n9.Memory: 8GB RAM+256GB ROM\n10.Multi Media: MP3/MP4/3GP/FM Radio/Bluetooth\n11.Camera: 18MP+48MP\n12.Multi Function: Full screen, Face recognition, Dual SIM, Wifi, GPS, Gravity Sensor, Alarm ,Calendar ,Calculator ,Audio recorder ,Video recorder, WAP/MMS/GPR, Image viewer,E-Book,World clock,Tasks card rear flash IML rear cover\n13.Languages: Multi-language support\n14.Others: Android OS 10.0 System\n15.Battery: 5000Mah Lithium-ion battery\n\nAttention:\nDue to the difference in light, the actual color of the phone may be slightly different from the screen and the picture. Color names are only used to distinguish between individual SKUs. Please understand that. Thank you.\n\nThe battery capacity is typical of the factory laboratory, the specific charging speed, the length of use and other data, the actual situation will be slightly different due to the power cord, power adapter, ambient temperature. When the phone is completely out of power and automatically shuts down, you need to charge your phone for more than 10 minutes to b",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "[4U] Musical Baby Crib Mobile with Projection Music Box Rattle Bed Bell Toys for 0-18 Months (without Bat",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9101226497&shopid=345971154",
        "org_price": "37.5-37.5",
        "new_price": "18.75-18.75",
        "desc": "Features:\n-The baby bed bell is made of superb cloth material.It is durable and sturdy.The sturdy arm can be easily attached to any crib.\n-Suitable for cribs, cribs, strollers, strollers, car seats, cribs, etc. \nIt has an adjustable moving arm that is very easy to install. \n-Soft wind bell music soothes baby's crying mood and help your baby fall asleep.\n-Music box and rattles can be take-along. operated without battery.\n-The stable bracket is safe and reliable, and does not injure the crib.\n-Exercise the coordination ability of infants and children's hands and eyes to promote the healthy growth of infants and young children.\n-The baby crib mobile bed bell is suitable for little baby below 3 years.It will make your baby fall asleep quickly.That can help you save more time and effort.\n\nSpecification:\nName: Baby bed bell\nMaterial: Plastic+ Electronic Components\nSize: 49*35*42cm\nColor: as shown \nPackage included:\n1 × Baby Crib Mobile Toy with a colorful box\n\nNote: Please allow 1-2mm errors due to manual measurement. Due to the difference between different monitors, there are color differences, please take the real product as the stan",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "MYRON Stands Mobile Phone Holders Black 360 Degree Rotating Bike Phone H",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6840254941&shopid=50970275",
        "org_price": "9.7-9.7",
        "new_price": "4.66-4.66",
        "desc": "<div><p>Fit Handlebar Size: 1.67 cm-4.27cm diameter\nName:Phone Holder\nType:Simple and practical\nColor: black\nMaterial: Silicone\nFeature:\n-Wrap around, Push through and Secure, Yes, it is that simple!\n-Universal phone mount: firmly hold 4\" to 6\"  screen smartphones\n-Fits 1.67 cm-4.27cm diameter handlebars: The innovated silicone mount belt makes it so easy to attach or detach from any size of handle bars of bike, motorbikes, or even a baby stroller.\n-Our bike mount is molded from Integrated Environmental Silicone, so no moving or glued parts to wear or metal screws to rust\n-Comparing with hard plastic holders, the flexible silicone absorbs all shocks, so your phone will never fall off, and the soft silicone will also not scratch or damage your expensive smartphone, even ride through bumpy roads\n\nPackage included: 1 X Bike phone mount</p><",
        "brand": null,
        "discount": "52%"
    },
    {
        "name": "Universal Bicycle Mobile Phone Holder Silicone Motorcycle Bike Handlebar Stand Mount Br",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4356608939&shopid=202244526",
        "org_price": "4.0-4.0",
        "new_price": "1.85-1.85",
        "desc": "Feature\nProtect your mobile phone from shaking,scratching with soft and anti-slip silicone gel.  \nSpecial stretch clip with silicone support band design for safety lock, strengthen locking function, keeps your device more secure.\nFit for bicycle,motorcycle handlebar 15-60mm\n\nSpecification\nMaterial: Silicone\nColor: Black\nSuit for: 4-6.5 inch Phone\nStyle: Mobile Holder For Bike,Phone Holder Motorcycle\n\nPackage Include\n1X Bicycle Handlebar Cell Phone Holder with Silicon Support",
        "brand": null,
        "discount": "54%"
    },
    {
        "name": "[Healing Shield Official] Ring Two You / Double Ring Holder Mobile 360 Ring Stand H",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8521021820&shopid=125285529",
        "org_price": "13.99-13.99",
        "new_price": "8.4-8.4",
        "desc": "[Healing Shield Official] Ring Two You / Double Ring Holder Mobile 360 Ring Stand Holder\n\n\n- Multiple Angle : 360 degree revolution is available. You can hold it anywhere with various degree.\n\n- Only One Finger Needed : Available for Multi-tasking with only single finger.\n\n- Multiple Angle for Stand : Double ring system can possible to stand it with multiple angle. Now enjoy it at the office and cafe.\n\n- 3MM : 3mm thickness will not disturb when you put your phone in the pocket.\n\n- 4 Matte Type Color : Gold, Rose Gold, Silver, Black\n\n- High Strength Adhesive : The strongest adhesive can hold until 5kg. It can be possible to lift tablet.\n\n\n\nPontree Corporation is one of the leading manufacturers in the protection film industry in Korea.\n\nHealing Shield, our premium flagship brand, has over 30,000 kinds of protection film lineup for IT products, home appliances and cars. We have been exporting to about 40 countries and have more than 50 installation retail stores in Korea, 1 in Hong Kong and 1 in Indonesia.\n\nWe have been ranked as No.1 in protection film market for IT devices by Korea Consumer Appraisal Index (KCAI). Our corporate affiliation laboratory is government-certified and has received the “Inno-Biz” certification from Korean government. Also, we are ISO certi",
        "brand": "Healing S",
        "discount": "40%"
    },
    {
        "name": "6pcs/set Car Model Toy Pull Back Car Toys Mobile Vehicle Fire Truck Taxi Model Kid Boy Mini Cars Toys Children Gif",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6563078283&shopid=290633826",
        "org_price": "9.24-9.24",
        "new_price": "3.7-3.7",
        "desc": "Specifications:\n100% Brand new and high quality. \nName: Mini pull back car\nMaterial: Plastic\nColor: 3 Colors\nSize: As the picture show\nAge Range: >3 year\nQuantity: 6PCS\nSize:10.3*3.5*9.6cm or 4.05*1.38*3.8inch about\nPer car size:3.1*3.2*4.4cm or 1.2*1.3*1.7inch about\nNote: \n1.Due to the light and screen difference, the item's color may be slightly different from the pictures. We guarantee the style is the same as shown in the pictures.\n2.All dimensions are measured by hand, there may be 0.5-1 cm deviations. \n3.Your satisfaction and positive feedback is very important to us. Please leave positive feedback and 5 stars if you are satisfied with our items and services. \n4.If the item damaged, please contact us firstly immediately before leave feedback. Thanks for your understanding!\n\nPackage Included:\n6PCS/Set Mini Pull Bac",
        "brand": null,
        "discount": "60%"
    },
    {
        "name": "Ready Stock Anti Radiation Protector Sticker For Mobile Phones Laptop  Negative Ions EMF Block",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4025808670&shopid=83083657",
        "org_price": "1.73-2.67",
        "new_price": "1.21-1.86",
        "desc": "------------------------------------------------- Welcome ---------------------------------------------------  \n   ▶ My darling,hope you have a nice shopping experience in CLOSETONLINE ^_^\n\n\nFeatures:\n1. Reduce EMF: This sticker absorbs EMF and counteracts harmful effects of EMF / EMR radiation generated\nby electronic devices, reduce radiation by up to 99% with radiation shield sticker.\n\n2. How it Work: Radiation shield sticker is made of radiation protection film and negative ion film, releasing\nnegative ions that neutralizes positive ions produced by electronic devices, protecting our health from EMF radiation.\n\n3. Widely Used: This radiation shield sticker as a EMR protector for tablet PC, cell phone,kindle,computer,air\nconditioner,refrigerator,microwave oven, printer,washing machine,etc. it transforms radiations into other\nharmless forms without blocking signals!\n\n4. Easy to Use: You can stick EMR sticker easily to the back of your cell phone and other electronic devices.\nThe EMF radiation shield does not degrade! It has very long service life, no need to replace it yearly, and it\nwill serve you for a long time.\n\n5. Slender Size: Light and thin enough that won't make the phone heavier, stickers avoids having a too big\nthings behind your cell phone when you put it on a table, you can take it anywhere! Protect you and your\nfamily from radiation.\n\nPacking List:1/5/10*Radiation Protector Sticker\n\nIntended for:\n1. Pregnant women, children, the old man, patients.\n2. People who use mobile phones,computers,electronic devices often.\n3. People who often use Tablet PC, Kindle,Computer,Air conditioner,Refrigerator,Microwave Oven, Printer,\nWashing machine, medical and office automation equipment.\n4. People living or working in the vicinity of high-voltage, substation, radio, radar station, and electromagnetic transmission tower.\n\nHow to use:\n1. Flaking and stick to the back of the phone or any other electronic devices.\n2. Some devices may require only one Radiation protection sticker, and other devices may require 2, 3,or more depending on the nature of the device.\n\nNote: \n1.Size Chart can be found in the product picture.\n2.Processing Takes 1-2 Days and Delivery Needs 10-20 Days.\n3.Please Allow 2-3 cm Difference. The Color Of The Actual Item May Vary Slightly From The Images Above.\n4. Sharing Social Apps to Get Special Coupons\n5. Don’t give bad rating. Any Problem can Leave Us A Message to solve. Five Stars Rating and repeat order will get Extra Coupons.\n\n\nContact Us by “Chat”\n1.Before a neutral (3 stars) or negative (1-2 stars) comments；\n2.If there are problems after taking goods, less delivery, slow delivery and defective goods, please “chat” contac",
        "brand": null,
        "discount": "30%"
    },
    {
        "name": "PROMEND Aluminum Alloy Bike Mobile Phone Holder Adjustable Non-slip MTB Bicycle Smartphone Mount Stand Bracket Cycling Access",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8757237630&shopid=447707081",
        "org_price": "26.7-26.7",
        "new_price": "11.45-11.45",
        "desc": "Please note：If you want to buy the 299B Black or 299B Titanium mobile phone holder, please check the bicycle part below. You can also choose 229 style for most bikes.\n\nBrand Name: PROMEND\nMaterial: Aluminum alloy\nSJJ229\nColour: Black, Golden, Silver, Titanium\nApplicable phone width: 55-95mm\nSuitable for handlebar diameter range: 25mm-31.8mm\nSJJ229B\nColour: Black, Titanium\nApplicable phone width: 55-95mm\nThe handlebar support screws have a maximum width of 3.6 cm and can be used on most bicycles.\n\nFeatures:\nBold screw\nBold rotary rod\nTilt angle design\nStrong and durable\n360 Degree rotation\nCushioning patch design\n\nPackage included:\n1Pcsx Bicycle mobile phone holder\n\nNotes：\n1.Due to the different monitor and light effect, the actual colour of the item might be slightly different from the colour showed on the pictures.\n2.Please allow 1-3cm errors to the actual dimension due to manual measure",
        "brand": null,
        "discount": "57%"
    },
    {
        "name": "Samsung Galaxy A12 | 128GB 4GB | Local Samsung 1 Year Warranty | Mobile A12 | FREE Back Cover & Ear",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4872059502&shopid=48961570",
        "org_price": "228.0-228.0",
        "new_price": "199.0-199.0",
        "desc": "Samsung Galaxy A12 (2021)\nBrand New Sealed Set\n100% Original authentic from Singapore\nLocal Set with 1 Year Warranty\nTax Invoice will be issued to claim warranty\nRegister for warranty at samsung.com.sg\n\nFREE! FREE!! FREE!!!\nBack Cover\nEarphone\n\nTake Note :\n************\n1. All Samsung Phones/Tablets come with 1 Year warranty by Samsung SG unless otherwise stated.\n2. All technical assistance shall revert back to Samsung Service Centre or Contact them 1800-Samsung.\n3. Seller is untrained and unable to provide repair or any technical assistance.\n4. Hard copy receipt is included \n5. Seller does not provide soft copy, duplication or reissue of receipt.\n6. No Exchange No Return Policy.\n\n#Samsung#A31#A11 #A12 #a21 #oppo #vivo #mi#redmi #x",
        "brand": "Sa",
        "discount": "13%"
    },
    {
        "name": "Baby Rattles Crib Mobiles Toy | Baby Crib Hanging Toys with Music | Baby Bed Musical Bell | Rot",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6558989480&shopid=42319072",
        "org_price": "-1e-05--1e-05",
        "new_price": "23.0-25.0",
        "desc": "✨ Main Features ✨\n✿ Use on cribs, play yards, carriers, strollers, bassinets and more\n✿ Bring a comfortable environment which is suitable for baby sleep\n✿ Easy to install, no screws needed\n✿ Winding drive design, no batteries needed\n✿ Soft melodies and movements encourage baby's hearing, visual and early childhood intelligence development\n✿ Super soft fabric is delicate and skin-friendly, non-toxic and safe, and will not lint and fade\n✿ Safe ABS material \n✿ Arm bracket kit: Ideally for crib and stroller\n✿ Designed to fit standard cribs\n✿ Can add on battery music box (35 songs, each song around 10s)\n\nMade in China\n\n💡 Notes:\nDue to the difference of display resolution and lightness, there may exist a tiny bit color difference in reality, which does not make any sense to the product itself; all the dimension information offered is manual measurement, it may cause an allowable error from 2-3cm. Thank you so much for your understanding.\n\nItems will be shipped out within 3 business days after your successful payment and we’ll send you the tracking number for logistic information. Please be patient and thanks a lot for your understanding.\n\nStrictly NO refunds or exchanges allowed due to hygienic rea",
        "brand": null,
        "discount": null
    },
    {
        "name": "⚡️Multi functional Mobile Phone Desk Stand Adjustable Universal  Handphone Holder Strong Phone Stand [S",
        "link": "https://shopee.sg/api/v2/item/get?itemid=3961317291&shopid=301261202",
        "org_price": "4.4-29.9",
        "new_price": "4.4-17.99",
        "desc": "💕【Welcome to SG nice local Shopee Store】\n\n❗Local Stock, Ships out from Singapore within 24hrs\n❗100% Genuine Products \n❗Local Support service \n\nThank you! \nPlease give me five-star praise ⭐⭐⭐⭐⭐\nIf you have any quality problems, please contact our customer service colleagues. We will help you solve any problems as soon as possible. If there is a quality problem, I will replace it for you or send you a new product, please don’t worry\n\n💢 Note：After receiving the product, if you have any questions, please contact us first. If you have already given a 1-3 star rating and you cannot modify the rating, we will not provide the above services. (Under the Shopee rules, after you have rated the order, you still have a chance to modify the rating)\n\nNotice:\nThe selfie light is mixing Colours to send!!!!\n\n\nbasic black holder\nProduct Details:\nPhone clip can clip size: 60-95mm\nFit for 3.5-7 inch phone\nFeatures:\n1. Strong structure;\n2. Easy to disassemble;\n3. Convenient storage\n\nRecommended reason:\n1. The structure at the bottom is stable, strong and does not shake;\n2. Easy to assemble and storage\n3. Fit for all type of mobile phones\n4. 360 degree rotation\n5. Adjustable height\n\n\nupgrade holder\n\nMobile desktop support telescopic live broadcast multi-function lazy support Bluetooth camera network class watch TV drama chase artifact\nmodel:New upgrade model-\n[ivory white],New upgrade model-\n[Cool Black],New upgrade model-\n[Sakura pink],New upgrade model-\n[Dark Night Green],Telescopic-single stand,Telescopic type-dual stand,Telescopic type-three-position bracket\nsize:Single bracket,Bracket + Bluetooth Selfie,Bracket + fill light\n\n● Local SG Seller, Fast Delivery\n\n🙏 Please contact us before neutral (3 stars) or (1-2 stars) comments. We will try our best to solve the problem and make your shopping enjoyable.\n\n\n#stand #stands #holder #phonestand #phoneholder #holderstand #universal #ipadmini",
        "brand": null,
        "discount": "70%"
    },
    {
        "name": "Finger Ring Holder Creative Lazy Mobile Phone Holder Bracket Rotating Ring B",
        "link": "https://shopee.sg/api/v2/item/get?itemid=11409064043&shopid=175116620",
        "org_price": "1.48-1.48",
        "new_price": "0.89-0.89",
        "desc": "Packing:\nOne Phone Holder Ring\n\n# Finger Ring Holde # Mobile Phone Lazy Metal Ring Buckle Phone Bracket # St",
        "brand": null,
        "discount": "40%"
    },
    {
        "name": "Upgrade mobile phone stand, tablet phone stand 5.0, suitable for Ipad Pro Iphone stand, folding stand, telescopic ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9829518808&shopid=161840722",
        "org_price": "10.0-10.0",
        "new_price": "4.99-4.99",
        "desc": "【product features】\nTelescopic lifting adjustment, adjust height according to needs\nThe angle can be adjusted, can be upright or horizontally\nTaking photos and chasing dramas, a must-have artifact for live broadcast\nRelease your hands and no longer have shoulder and neck soreness.\nThere are reserved mobile phone charging holes, which can be used while charging\n\n【Two colors】\n❤Pearl White\n❤Black\n\n【Standard Edition Product Information】\nVertical size: 12.5*6.6cm\nExtended size: 15.6*11cm\nWeight: 150 grams (including box)\nMaterial quality: ABS\n\n[Applicable mobile phone and tablet]\nMobile phone: 4.7~6.8 inches.\nPlate: 7 inches to 11 inches.\nWith shell thickness: within about 1cm\nThe low height of the flat plate can only be used horizontally, not vertical\n\n[Please note before placing an order]\nPlease read the announcement on the homepage of the store carefully before placing a bid, the bidding is deemed to be agreed.\nThe picture is slightly lit, because everyone’s screen has a different color, and there is a risk of color difference. The defect is defined as affecting the use of the product.\nThe following conditions are not defective: small thread ends, slight size errors, color difference, slight dirt (cleanable), new product smell, etc.\nThe mass production of the goods in the factory or the delivery process may cause defects. Please check whether there are any defects, etc. before receiving the goods.\nAnd contact us within three days.\nIf the buyer wants to cancel the order, he can cancel it before the seller applies for the order number. The order status is \"Order processing\", and the order cannot be cancelled.\nDo not use evaluation as a communication bridge. If you have any questions about the product, please chat first and let us handle it for you.\n\n[Shipment note]\nA large number of stocks are welcome to place an order, and it will be shipped within 2 days after the bid, please wait patiently\nWe ship from Shenzhen overseas and arrive in about 15 days\nWe will notify you if there is any shortage\n\n[Customer Service Consultation]:\nOnline consultation, you are welcome to ask if you have any questions, and a dedicated person will serve you online.\nIf you find that the product is abnormal when you receive the product, please take a picture of the product and the manifest and send it to the chat. The customer service staff will handle it for you immediately during working hours.\nService hours: Monday~Friday 10:00~20:00 (closed on holidays and national holidays)\nIf there is a private message that has not been answered within a day, please chat again, and the shrimp chat will occasionally fail to eat the me",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "30mm Mobile Phone Magnetic Metal Plates Disc Plate/Mini Round Lron Sheets Car Phone Holder With Adh",
        "link": "https://shopee.sg/api/v2/item/get?itemid=3263679044&shopid=127249066",
        "org_price": "3.21-3.21",
        "new_price": "0.69-0.69",
        "desc": "Welcome\n\nProduct description:\n\n30*0.3mm magnetic sheet double-sided adhesive magnetic iron sheet mobile phone holder magnetic sheet\nType: magnetic sheet\nPurpose: Used to cooperate with magnetic mobile phone holder (itself does not have magnetism)\nMaterial: iron sheet\nSize: 30mm in diameter and 0.3mm in thickness\nquantity: 1\n\ndescription:\nSuitable for all smart phones, tablets and GPS devices.\nSafely protect equipment or hands from scratches.\nEasy to put on and take off, leaving no residue.\nInstructions:\nIf your phone has a protective cover, you can stick the metal plate to the outside of the phone protective cover.\nIf you do not use a protective cover, you can paste the metal plate on the back of the phone.\n\nThe package includes:\n1*Mobile phone holder magnetization sheet\n\n★Note:due to the light and screen difference, the item's color may be slightly different from the pictures. please understand. please allow some differences due to manual measurement.\n\nBest service:\n★Fast shipping\n1:Ready stock \n2:About 6-14 days arrive your address \n★ Buyer protection\n1:Fully refund if you don't receive your order\n2:Fully or partially refund,if the item is not as described\n\n★ Dear friend:you may find that someone sells at a lower price than us but they cannot guarantee the same quality and service as we do,thank you!\n\n#xinzhan\n#trendycollection\n#marvelousworld\n#xinzhan2\n#slyvia\n#ILOVEDIY\n#melanie\n#mel",
        "brand": null,
        "discount": "79%"
    },
    {
        "name": "（Ready stock）Mobile Phone Straps USB Key Short Lanyard Adjustable Walkie Talkie Hand Strap Wrist Rope Audio Anti-lost Lanyard For Keys ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=11912901952&shopid=310344151",
        "org_price": "5.98-5.98",
        "new_price": "2.99-2.99",
        "desc": "*From stock, please do not hesitate to order.\n*Order will be delivered within 24 hours after payment\n\nWhat You want silicone Anti-lost Lanyard Q Bomb/pull-resostamt.\nThe thread end is woven from high tenacity silk material abrasion resitance is not easy to break and beautiful.\n\nProduct features：\nThe quality of the product is excellent and soft silicone material will keep you more comfortable all day at work or any event.\nDifferent colors for your choice.\nIt will coordinate with all of your outfits .Give you a fashion and unique look.\nThe bright candy colors will let you identify what they are and also finding what you want more easier.\nPerfect for carrying ID card, name tag, access card, keys, keychain, cell phone case, wallet, and the other portable items.\n\nDescription:\nWeight: about 3.6g\nSize: Before stretching: about 19*1*1cm, after stretching: about 26*1*1cm\nMaterial: Silicone\nQuantity: 1pcs\n\nPackage included:\n1 pcs Universal Silicone Cell Phone Lanyard Holder\n\nWhat You want silicone Anti-lost Lanyard Q Bomb/pull-resostamt\nThe thread end is woven from high tenacity silk material abrasion resitance is not easy to break and beautiful\n\n\nNote:\nDue to the different monitor and light effect,the actual color maybe a slight different from the picture color.\nPlease allow 2-3cm differs due to manual measure",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "realme C25s 4GB+64GB Global Version [2 years Local Official Warr",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8662188260&shopid=188261636",
        "org_price": "229.0-229.0",
        "new_price": "184.0-184.0",
        "desc": "realme C25s [Shopee Exclusive] \n | 4GB+64GB | Helio G85 | 6000 mAh | 48MP AI camera | 2 years warranty\n\n1. Battery\n6000mAh Mega Battery\nrealme C25s features a huge 6000mAh battery with which you can enjoy non-stop usage, whenever you want. According to test of realme Lab, realme C25s could last for 51 days in standby mode, it’s even far more better than some flagships.\n\n2.Performance\nHelio G85 Processor\nThe realme C25s features a built-in powerful Helio G85 gaming processor that brings a new upgraded smooth gaming experience for young game players. It is a 12mn Octa-core processor that clocks up to 2.0 GHz and adopts two powerful Arm Cortex-A75 CPUs operating up to 2GHz and six Cortex-A55 processors operating up to 1.8GHz. This powerful game-oriented processor is capable of handling any mainstream game with ease in performance. Compared to other phones in this segment, the benchmark score of realme C25s goes higher.\n\nInstant Fingerprint Sensor\nrealme C25s can not only support ultra-fast fingerprint unlocking, but also support facial recognition, which can be easily unlocked with a single click or glance. Convenient to unlock and safe for your privacy at the same time.\n\n3. Design\n16.5cm（6.5'') Large Display\nEquipped with a 6.5-inch 20:9 screen, realme C25s brings a larger field of view, provides excellent game, audio and video experience. Allowing you to enjoy wider field of view brought by large screen and less visual disturbance, while giving you an experience of near-full screen. \nGeometric Art Design\nrealme C25s will be available in ONE exciting color Water Blue.\nMeanwhile, the layout is different. The back cover is processed the texture using the industry leading German five axis precise radium engraving machine and after 300 minutes of polishing. Finally, 450+ curves are engraved to create special reflective light effect. The use of this technology makes realme C25s more colorful, appealing, comfortable in your hands, less susceptible to fingerprints and effectively prevents scratching and sliding.  \nThe camera module is also designed to a square which is popular recently. The len, flashlight and camera specs are located sophisticatedly on the edges and corners, which make the back cover more premium and trendier.\n\n 4. Camera\n48MP AI Triple Camera \nrealme C25s upgrades to 48MP triple camera, which makes C25s stands out from competition in the segment.\n48MP Super clear main camera \nrealme C25s has a primary camera that adopts 48MP image sensor with large area, with f/1.8 large aperture that secures enough light and makes your pictures more clear and brighter. In addition, the product also supports PDAF that makes the focus more rapid and precise. 5x zoom also enable users to shoot a clear photo from long distance.\nMacro Lens\nrealme C25s comes with a Macro Lens with super close focus distance. It will empower consumers with the possible to shot amazing macro photography with details, enjoy explore the charm of the micro world.\nB&W Lens\nThe B&W lens provide special artistic effect for portrait, which reproduce portraits in black and white, providing higher exposure and enhancing the contrast between light and dark of images. In the Portrait mode, exposure, color temperature, hue, and other parameters are repeatedly fine adjusted. In conjunction with the simulation of master portrait works, photos are tuned to retro film style with wide applicability, adding texture to the final portrait-style photos.\n8MP Selfie Camera\nOn the front, 8MP selfie camera can take crystal clear selfie. The camera also supports AI beautification function, HDR Mode, Portrait Mode and so on. Overall giving you the best camera experience in the segment.\n\n5. TÜV Rheinland Smartphone High Reliability Certification\nTÜV Rheinland\nEvery realme mobile phone goes through rigorous quality tests to give you the best experience. In order to keep up with our young users’ active lifestyles, realme is constantly seeking quality improvements. We have partnered with the world-renowned authority in quality -- TÜV Rheinland.\n\nTÜV Rheinland stands for safety and quality in virtually all areas of business and life. Since 2006, TÜV Rheinland has been a member of the United Nations Global Compact to promote sustainability and combat corruption.\n\nTÜV Rheinland High Reliability Certification\nOver the last 8 months, realme and quality specialists at TÜV Rheinland worked together to set new, upgraded quality standards for smartphones. The TÜV Rheinland Smartphone High Reliability certification sets a high quality standard for consumer electronics as well as industry standards for major markets around the world.\n\nAccording to TÜV Rheinland's new Quality certification standards, most test conditions are based on the three-year life cycle of smartphone. The TÜV Rheinland Smartphone High Reliability Certification contains 23 major tests, including 10 Daily Use Test Scena",
        "brand": "r",
        "discount": "20%"
    },
    {
        "name": "MUMENG Transparent Inflatable Waterproof Bag Mobile Phone Waterproof Bag Swimming Mobile Phone Waterproof ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7260021633&shopid=181839949",
        "org_price": "8.99-8.99",
        "new_price": "1.59-1.59",
        "desc": "*Welcome to  MUMENG Store.Happy shopping!\n*shopping tips:\n\nColors: white, yellow, green, blue, black, pink \nScene: diving, swimming \nMaterial: pvc\nSize: less than 6 i",
        "brand": null,
        "discount": "82%"
    },
    {
        "name": "[READY STOCK] Mione Universal Mobile Phone Stand Holder Desk Non Slip Foldable Aluminum Adjustable Desktop Tablet Holder Stand  iPad H",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7565782789&shopid=309779838",
        "org_price": "14.95-14.95",
        "new_price": "3.99-3.99",
        "desc": "👑Welcome to Mione.sg Official Store👑  🤞follow us to get $0.2 off discount🤞.\n  ★Free shipping ★ cash back★ Good Price ★ discount★\n\n【Foldable design】 compact size, you can collect and storage easily \n【Extendable arm】you can adjust the holder height freely\n【Adjustable View】  It allows you to adjust and choose your best conformatable viewing\n【Aluminium alloy material】hold firmly,provide soft rubber on the panel to protect your phone.\n【Superior Compatiblity】Compatible with all  all mobile phone and small & Large tablet .\n【Charging Holde Design】 No worrying about devices power off when playing games in glee\n\n\nMaterial:\n1. The ipad holder stand is made of aluminum alloy which will keep your phone sturdier \n2. The anti-Slip Clip with rubber pad lock the your phones, tablet and ipad firmly.\n3. The tablet holder with soft silicone pads on panel will also protect your phone from being scratched\n\nSpecification:\n【Product name】: mobile holder ipad stand \n【Colors】: black, white, pink with mirror \n【Material】: Aluminum alloy + silicone \n【Application】: desktop holder \n【Function】: phone/ tablet arm, free your hands, for better sitting gesture and viewing \n【Completed】:  phone stand holder\n\n⭐ Informations ⭐\n※ Thank you for your coming and your support. If commodity has any question, please contact us before your evaluation of goods.\n※ Have a happy shopping. Thank you very ",
        "brand": null,
        "discount": "73%"
    },
    {
        "name": "DAYLAN Mobile Phone Charging Stand,Wall-mounted Shelf, Stick-free Perforated Shelf,Household Bedside Wall Multifunctional Art",
        "link": "https://shopee.sg/api/v2/item/get?itemid=3288913823&shopid=67729795",
        "org_price": "5.6-5.6",
        "new_price": "1.99-1.99",
        "desc": "Ready Stock Remote Control Mobile Phone Cable Plug Holder Wall Mounted Storage Charging Multipurpose Holder Stand \r\n\r\nOrganize your home with this colorful wall mounted phone / remote control holder.\r\n\r\nProduct Specifications:\r\n* Size: 9.5cmx10cmx3cm\r\n* Material: ABS\r\n* Colour: Blue / Green / Pink / Yellow\r\n* Weight: about 45g\r\n\r\n 🌈Multipurpose\r\n Phone / Remote Control / Cable / Key Holder\r\nColorful / Modern Design\r\n1:No drilling is needed, easy installation\r\n2:Strong adhesion\r\n3:Space saving\r\n4:Durable,\r\n5:Suitable to use in living room, bedroom, kitchen, etc.\r\n\r\n📦Package inclued:1pcs phone holder box\r\n\r\n\r\n#phoneholder #cableholder #remotecontrolholder #keyholder #MultiFunctional #livingroom #bedroom #homeorganizer #wallmounted #strongadhesion #LocalSeller #ReadyStock #FreeShi",
        "brand": null,
        "discount": "64%"
    },
    {
        "name": "Halloween popsocket cartoon cute shape epoxy folding mobile phone holder ring h",
        "link": "https://shopee.sg/api/v2/item/get?itemid=3642555621&shopid=111011066",
        "org_price": "-1e-05--1e-05",
        "new_price": "1.89-1.89",
        "desc": "Griptok PopSockets Hand Ring, cute version, cute new arrivals !!\nSelect the next pattern and pattern\nUse on the back of your smartphone or tablet with strong 3M adhesive.\n- Air bag leg can be extended to two levels\n- Helps to be held conveniently Selfie, don't be afraid of drop\n- Set the phone to the table to watch clips, watch movies, play social\n- Use to wrap the earphone cord\n- Helps to support your device from touching the surface directly when placed in various places.\n\n📌 The surface of the mounting area should be cleaned. Because dirt, dust, oiliness may reduce the efficiency of the glue\n\n-------------------------------------------------- -\n\n#popsockets # phone stand #Mobile stand #Mobile phone holder # Phone holder #phonesocket # mobile phone ring #Phone ring #pops",
        "brand": null,
        "discount": null
    },
    {
        "name": "Montessori Munari Hanging M",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7745705679&shopid=241022015",
        "org_price": "-1e-05--1e-05",
        "new_price": "20.8-20.8",
        "desc": "The first part of the Montessori Visual Mobile Series. This high contrast geometric mobile is the ideal first mobile for babies as they have limited visual sense. The elements are designed with specific proportions that ignite a child’s inherent mathematical sense. The sphere, strings, and shapes have mathematical relationships to one another and exposes infants with their very first math concepts!\n\nFor infants from 0 weeks+\n\nPurpose:\n\nEncourages focus and attention\nDevelop baby's visual se",
        "brand": null,
        "discount": null
    },
    {
        "name": "Ring Metal Mobile Phone Stand Holder For iPhone Magnetic Car Mount Stand",
        "link": "https://shopee.sg/api/v2/item/get?itemid=1853745174&shopid=99893455",
        "org_price": "1.23-1.23",
        "new_price": "0.86-0.86",
        "desc": "Compatible brand：Samsung/OPPO/Vivo/XIAOMI/Huawei/LG/HTC/ASUS....\nUse 1::universal Ring Holder\nCharger::No\nUse 2::ring phone holder\nCharacteristic::Portable Holder\nFunction::Finger Ring Holder\nMagnetic::Yes\nUsage 3::Ring Holder,Cell Phone Holder,Finger Ring Holder\nUsage 2::Mobile Phone Holder,Support for Mobile\nCompatible Brand::Universal\nCompatible::Holder Stand for iPhone X 8 7 7Plus 6 Plus 6S 5 5S SE\nUsage 1::Ring Holder for Samsang Huawei Xiaomi HTC\nMaterial::Metal\n#FingerRingHolder #RingHolder #foriPhone #:HolderStand #Metalring",
        "brand": null,
        "discount": "30%"
    },
    {
        "name": "Octopus Tripod Holder Mobile Phone Tripod Gorillapod for Mobile Phone Universal Smartphone Sports Camera Gopro Stand ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=1560300561&shopid=91509905",
        "org_price": "2.6-6.5",
        "new_price": "1.99-6.2",
        "desc": "Mini Octopus Tripod Holder Mobile Phone Tripod Gorillapod for Mobile Phone  Universal Smartphone Sports Camera Gopro Stand（10-30）\n\nFeatures:\n1. Flexible joint, and can rotate 360 to form the ideal shape.\n2. Ring and foot pliers provide extra grip for most surfaces.\n3. Link the attachment lock on your camera tripod to make it safe.\n4. Your camera can be used anywhere on this tripod.\n5. Support professional SLR camera tripod head and use zoom lens.\n\nSmall size for: small camera, camera size is 165 × 35 × 35 can bear 450g\nMedium for: small and medium-sized cameras, camera size is 245 × 50 × 50, can bear 1200g.\nLarge size for: SLR digital camera, small and medium camera, camera size: 250 × 60 × 60 ，can bear : 3000g\n\nProduct material: ABS\nPacking list: 1* br",
        "brand": null,
        "discount": "23%"
    },
    {
        "name": "🔥In Stock🔥Invisible Bike Holder Round Aluminium Alloy Mobile Racks Portable Cycling Phone Mount Bicycle Access",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8510760125&shopid=266794413",
        "org_price": "22.0-22.44",
        "new_price": "11.9-13.99",
        "desc": "-----------😁 Welcome to S S S BIKE shop! 😁------------\nType: Bicycle Phone Mount\nMaterial: Aluminum\nWeight: 104g\nBoth large and small sizes are suitable for applications: 58-85mm wide mobile phones\nMade of high quality aluminum alloy, our phone bracket has strong durability and high strength, and it is wear and rust resistant and can last for long-term usage.\nThickened ring\nLatest non-slip design, making our phone holder more strengthening and stable for holding phone more steadily and firmly.\nNot take up space\nIt can be installed and fixed on the bike handlebar for your convenient use without taking up space.\nFor horizontal navigation\nYou can fix your mobile phone into the bracket horizontally for your more advantageous navigation, and it is very practical and helpful for your daily usage.\nCompatible\nSuitable for 58-85mm width mobile phone, very universally applicable.\nSpecifications\nName: mobile phone holder\nModel: TP01\nMaterial: aluminum alloy\nWeight: 104g\nColor: black, silver, red\n🚩Welcome to the distributor/dealer/wholesale/agent!\n🚩Become a fan and enjoy exclusive discounts\n🚩For more information, please contact customer service\nIf you are satisfied with the product, 5 5 evaluation cash back 2 SGD, and become a fan to enjoy a disc",
        "brand": null,
        "discount": "46%"
    },
    {
        "name": "Original Apple iPhone 5 iphone4s Used Cellphone GSM 3G Unlocked Mobile Phone 16GB 32GB 64GB ROM Wifi 8MP 4.0\"   90% As",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9060392389&shopid=453403113",
        "org_price": "35.0-69.0",
        "new_price": "26.25-55.2",
        "desc": "Brand Name : APPLE\nApple Model : iPhone 5 \nBattery Type : Not Detachable\nROM : 16G\nCharging Power : Other\nOrigin : CN(Origin)\nItem Condition : Used    This is used phone, Look conditions 90% like new. \nOperation System : ios\nBiometrics Technology : NO\nFront Camera Quantity : 1\nRear Camera Pixel : 8MP\nBattery Capacity(mAh) : 1440\nTouch Screen : Yes\nFast Charging : Nonsupport\nLanguage : Italian\nDisplay Resolution : 640x1136\nRAM : 1G\nRear Camera Quantity : 1\nCertification : CE\nCharging Interface Type : Other\nFront Camera Pixel : 2MP\nWireless Charging : NO\nDesign : BAR\nSIM Card Quantity : 1 SIM Card\nDisplay Size : 4.0\n3.5mm Headphone Port : YES\nScreen Type : Normal Screen\nStandby Time : Up To 48 Hours\nNFC : NO\nOptical Zoom : 3X\nScreen Material : LCD\nThis is used phone, Look conditions 90% like new. \n all features work well\n(Any sim card / Wordwide can use)\nGood&Original quality \n\n(PACKAGE)\n1x Apple iPhone (100% Original)\n1x Usb Cable\n1x Case\n* Accessories not ori",
        "brand": null,
        "discount": "33%"
    },
    {
        "name": "MOBIL 1 ESP 5W-30 (Europe) 4 Litre *FREE SHIPPING* *NO MIN S",
        "link": "https://shopee.sg/api/v2/item/get?itemid=2928056719&shopid=250786869",
        "org_price": "-1e-05--1e-05",
        "new_price": "52.0-52.0",
        "desc": "*FREE SHIPPING* *NO MIN SPEND*\n*STORE WALK-IN PURCHASE PRICE: 6% OFF WEBSITE PRICE* (BASE ON STANDARD PRICE)\n*SHOPEE PROMOTIONAL PRICE DOES NOT APPLY TO WA",
        "brand": "Mobil",
        "discount": null
    },
    {
        "name": "【24H SHIPS】MEMO Mobile Phone Cooler Cooling Radiator Semiconductor Fan Portable Gaming Mini Controller With Cooling Fan For PUBG M",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7552691517&shopid=213719630",
        "org_price": "10.0-31.0",
        "new_price": "5.9-18.4",
        "desc": "✅【All goods are in stock】\n💁【We ship within 24 hours of your order】\n🚚【You can receive the package within 5 to 10 days】\n📦【Checked before shipment and properly packed to avoid damage during shipping】\n🔄【Product can be replaced free of charge if it fails within 1 month】\n\n🔥Highlights:\n\n* A variety of products with semiconductor heat dissipation and air-cooled heat dissipation are available to meet your different needs\n\n* Use semiconductor heat dissipation technology to cool down the phone more quickly, reducing the phone temperature by 30℃ in 1 minute\n\n* Use a high-speed fan, which can effectively cool the phone by about 15°C\n\n* MEMO DL01：Semiconductor cooling、2 levels of wind adjustable、Powerful refrigeration、Telescopic fixed buckle\n\n* MEMO DL02：Semiconductor cooling、Powerful refrigeration、Telescopic fixed buckle、Can charge mobile phones\n\n* RAPTOR：Semiconductor cooling、colorful lighting、Silent fan、Telescopic fixed buckle\n\n* MEMO FL02：Fan cooling、Silent fan、Small size\n\n* MEMO FL01：Fan cooling、Rechargeable、RGB ambient light、6000 rpm powerful fan、3 levels of wind adjustable\n\n📘Specifications: \n\nProduct name：MEMO / Raptor\nProduct model：DL01 / DL02 / Raptor / FL02 / FL01\nInput voltage：5V\nInput Current：3A\n\n📦Package Included:\n\n1 * phone radiator\n1 * Charging Cable\n1 * User m",
        "brand": null,
        "discount": "63%"
    },
    {
        "name": "Original Apple iPhone 5 iphone4s Used Cellphone GSM 3G Unlocked Mobile Phone 16GB 32GB 64GB ROM Wifi 8MP 4.0\"   90% As",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9060392389&shopid=453403113",
        "org_price": "35.0-69.0",
        "new_price": "26.25-55.2",
        "desc": "Brand Name : APPLE\nApple Model : iPhone 5 \nBattery Type : Not Detachable\nROM : 16G\nCharging Power : Other\nOrigin : CN(Origin)\nItem Condition : Used    This is used phone, Look conditions 90% like new. \nOperation System : ios\nBiometrics Technology : NO\nFront Camera Quantity : 1\nRear Camera Pixel : 8MP\nBattery Capacity(mAh) : 1440\nTouch Screen : Yes\nFast Charging : Nonsupport\nLanguage : Italian\nDisplay Resolution : 640x1136\nRAM : 1G\nRear Camera Quantity : 1\nCertification : CE\nCharging Interface Type : Other\nFront Camera Pixel : 2MP\nWireless Charging : NO\nDesign : BAR\nSIM Card Quantity : 1 SIM Card\nDisplay Size : 4.0\n3.5mm Headphone Port : YES\nScreen Type : Normal Screen\nStandby Time : Up To 48 Hours\nNFC : NO\nOptical Zoom : 3X\nScreen Material : LCD\nThis is used phone, Look conditions 90% like new. \n all features work well\n(Any sim card / Wordwide can use)\nGood&Original quality \n\n(PACKAGE)\n1x Apple iPhone (100% Original)\n1x Usb Cable\n1x Case\n* Accessories not ori",
        "brand": null,
        "discount": "33%"
    },
    {
        "name": "KFS  Pulled mobile phone screen amplifier / 10/12/14 inch creative stretch / 3D Blu-ray ey",
        "link": "https://shopee.sg/api/v2/item/get?itemid=10417372972&shopid=447661128",
        "org_price": "21.76-35.76",
        "new_price": "10.88-17.88",
        "desc": "❤ welcome\nKung Fu store mainly deals in household appliances.\nWe have many experienced cooperative factories with good quality and low price.\nAll the goods in the shop are shipped on the Chinese mainland. You can get it in about 10 days.\nIf you have any questions, please contact us.\nThanks and Best Regards.\n\nArticle: amplifier\n\nApplicable scene: Desktop\n\nColor: white, pink, black\n\nModel: pull out amplifier\n\nApplicable brand: General\n\nApplicable model: General\n\nStyle: 10 inch pull [ordinary], 10 inch pull [super clear], 12 inch pull [ordinary], 12 inch pull [super clear], 14 inch pull [super clear]\n\nType: lazy bracket\n\nMore products and more styles can be selected by clicking \"view store\". Our store continues to carefully select products, constantly update products, you can follow our store to select your favorite products. Your good comments are our driving force. We hope you have a pleasant shopping experi",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "Cute Baby Rattle Cartoon Owl Snails Press Back Force Inertial Slide Rotatable Infant Mobile Educational Toy Kids",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7568413765&shopid=104618761",
        "org_price": "4.3-4.3",
        "new_price": "2.58-2.58",
        "desc": "Press-type power design.\r\nThe head can rotate 360°, making a clicking sound.\r\nSmooth the bottom wheels.\r\nMaterial: Plastic\r\nColor: send by random\r\nSize: 7x6x8cm\r\nGender: Unisex\r\nPackage Included:1 xBaby Toys \r\n \r\nNote:\r\nDue to the hand measurement, there have size error about 1-2cm.\r\nItem color displayed in photos may be showing slightly different on your computer mo",
        "brand": null,
        "discount": "40%"
    },
    {
        "name": "Montessori Dancers Hanging M",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6545695015&shopid=241022015",
        "org_price": "-1e-05--1e-05",
        "new_price": "18.9-18.9",
        "desc": "The 4th and final mobile in the Montessori Visual Mobile Series. Contains 4 stylized forms made with iridescent, holographic paper. When in motion, these forms represents human dancers that sparkles and provides babies with a performance of movement and light! \n\nFor infants 11 weeks+\n\nPurpose:\n\nDevelop concentration\nWorks on depth perception\nHones visual dynamic ",
        "brand": null,
        "discount": null
    },
    {
        "name": "3 Pcs Webcam Cover Camera Privacy Protective Cover,Mobile Laptop Lens Occlusion Privacy Cover Anti-Peeping Protector Shutter S",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6765290642&shopid=341308722",
        "org_price": "5.52-7.0",
        "new_price": "0.99-1.39",
        "desc": "Our Webcam Cover complements the shape of many laptops. Furthermore, the ultra-thin design will ensure that every laptop closes. Our design will complement your laptop, rather than being a thorn in your eye!\n\nInstructions for use: \n1.Remove the centrifugal paper from the back of the webcam cover;\n2.Align the lens and attach the cover to the lens;\n3.When the fit is finished, slide the camera cover.\n4.Note: Before install the cover, please clean the corresponding place. Otherwise the viscosity will be reduced and the protective cover will be easy to fall off. The cover will be strong, firm and tight after 24 hours.\n\n描述:\n100% Brand New and good quality.\nHigh quality\nMaterial:Plastic.\nColor: As the picture\nSize:18.5*9*0.7mm/0.73*0.35*0.03\"\nMATERIAL: plastic\nWEIGHT: 1-2g\n\nPACKAGE INCLUDED: 3pcs\n\n\nNOTE\n1.Please consider the dimensions and use only if the cover is appropriate for your laptop and allows it to close properly.\n2.Package contents: 3* Webcam Covers\nOnly the above package content, other products are not included.\n3.Note: Light shooting and different displays may cause the color of the item in the picture a little different from the real thing. The measurement allowed error is +/- 1",
        "brand": null,
        "discount": "82%"
    },
    {
        "name": "【2021NEW 】New novo 8 Pro Smartphone 7.3 inch HD Full Screen 5G   16GB RAM+512GB ROM  32MP + 64MP Camera Handphone  Mobile Phone 10 Core Face ID+Fingerprint ID 5600mAh Battery Smart Dual sim standby Android 11.0",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8374883166&shopid=479460571",
        "org_price": "225.77-225.77",
        "new_price": "119.99-119.99",
        "desc": "👏👏Welcome toY&B💗💗\n\n👉 We are a professional 3C mobile phone supplier.\n👉 Factory Outlet. 100% Brand New!\n👉Our Price are Lowest,and the Quanlity and Service are Top.\n👉 One year warranty！\n\n\n\nNote: It is not compatible with US direct phone, Sprint and Verizon operators!\nFeature:\n- 7.3inch Left digging scree\nThe novo 8 Pro delivers the viewingexperience you always wanted, With a massive 90% screen-to-body ratio on a 7.3inch screen\n- 32MP Front CameraClear and Stylish Selfies\nThe novo 8 Pro world-leading 32MP front camera turnsyour every selfe into a work of art Experience greaterbrightness, color vibrancy, clarity and dynamic range.even in the dimmest light, Whenever you needit. your novo 8 Pro is right there with you, capturing everymoment with crystal-clear precision, Turn your selfiesinto masterpieces and shine in every photo\n-Rear Ultra HD camera\nThe novo 8 Pro features a 64MP camera combination. The main camera sportsa large f/1.8 aperture and 1.28um pixels, This strong combination boosts photosensitibityin backlight or low light, Just point and shoot, and novo 8 Pro will makesure your pictures remain clear and bright\n- Face Access\n The novo 8 Pro also supports facial recognitionUpon activation, novo 8 Pro scans your facial features and unlocks instaneouslyAccessing your phone has never been so easy, or so fun\n- Powerful Performance\nThe MTK6889+ mobile platform with 7mm process technology makesyoung people who love the young and stiand other popular games.The game ison and lower\n- Android 11\nThe new interactive design makes the operation simple and simple, the use of themobile phone is so simple and straightforward, everything is handy\n- Dual SIM card + TF card\nDual card dual standby, no difference between the main and auxiliary bayonet ports, supports the network of 50 major communication operators in the world, and supports the installation of memory cards to make your storage space more abundant and a better experience.\n\nSpecification:Factory direct sales, better quality but lower price is our target and mission!\nModel No.: novo 8 Pro\nCPU: MTK6889+ Deca Core (Latest 10 Core)\nSIM/TF: 2 SIM Card Slots (Nano SIM) + 1 TF Card Slots (Maximum support extension 256GB)\nScreen: 7.3 Inch left digging screen\nResolution :1344*2772\nCamera: Front Camera 32MP+ Rear Camera 64MP\nMemory: 16GB RAM+512GB ROM\nSystem: Android 11 System\nBattery: 6800mAh High Density Lithium-ion battery\nUnique Back Cover: Thermally curved glass back cover.. It is art, it is also technology!\nNet-Work: GSM850/900/1800/1900MHz, 3G: WCDMA850/1900/2100MHz, 4G,5G\nVibration:Support\nMulti Media: MP3/MP4/3GP/FM Radio/Bluetooth\nMulti Function: Full screen, Face recognition,Screen fingerprint, Dual SIM, Wifi, GPS, Gravity Sensor, Alarm ,Calendar,Calculator,Audio recorder ,Video recorder, WAP/MMS/GPR, Image viewer,E-Book,World clock\nLanguages: Multi-language su",
        "brand": null,
        "discount": "47%"
    },
    {
        "name": "LED light Glowing Lightning Cable Mobile iPhone Charging Cables Apple iPhone IOS Android Micro Type C Fast USB Ch",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7762631952&shopid=283475787",
        "org_price": "3.53-3.53",
        "new_price": "2.23-2.23",
        "desc": "Welcome to YUANCHEN store\n\n100% Brand New and High Quality.\n\nBUYER Note:\nWhen You received goods, if the products broken or not satisfy with it, please Contact with us, please do not leave a negative feedback, We will try our best to solve it for you properly, Thank you!\n\n【LED Flowing Light Up Charging Cable】USB sync and Data cable shows a fluent light effect with smart function that modifies its speed. It slows down as the battery getting full and shuts down automatically when 100% charged.\n【High Speed Data Line】We use EL cold light technology. visible Cable support fast quick charging speed up to 3.0 amp and data transmission speed up to 480Mb/s. Great performance ensures Charge and data transmission simultaneously in extreme high speed\n【High Durable Flat USB Cord】High quality metal durable USB connector and soft TPE cover keeps excellent heat dissipation and flexibility, with a 5000+ bend lifespan several times longer than standard cables. This charging cable can backup files or transfer pictures, music and videos all while charging.\n【Easy to Carry Flowing】 Light data cable is packed with Velcro and storage bags, which make the cable easy\nFeature l : LED Flash Light Charging Cable\nFeature ll : High Tensile Braided Cloth Aluminum Alloy Head Sync Mobile Phone Cable\n\nWholesale big discount support !!\n\nFeedback>>>\nWe depend on customers' satisfaction to succeed. Therefore your positive feedback and 5 Score DSR are extremely important for us. If you are satisfied with our items, Please take a minute to leave your positive feedback. Thank",
        "brand": null,
        "discount": "37%"
    },
    {
        "name": "Huawei P8 Lite Unlocked 4G LTE Smartphone Dual SIM 5.0 inch screen Android mobile phone Octa-core 13MP Camera  GPS FM ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5350424237&shopid=287829476",
        "org_price": "175.98-175.98",
        "new_price": "59.0-59.0",
        "desc": "🔥 Huawei P8 Lite Android mobile phone\n💎 100% Brand New\n💎 100% Original Huawei Product\n💎 Unlocked Smartphone,with Google Play Store\n\n🔥Main features:\n💎 Memory: 2GB RAM+16GB ROM\n💎 4G Network, SIM：Dual SIM,Dual Standby\n💎 5.0 inches IPS LCD capacitive touchscreen\n💎 OS：Android 5.0.2 (Lollipop), upgradable to 6.0 (Marshmallow), EMUI 3.1\n💎 Chipset：Kirin 620 (28 nm)\n💎 CPU：Octa-core 1.2 GHz Cortex-A53\n💎 MicroSD Storage: TF card Up to 32GB,uses shared SIM slot (SD Card not included)\n\n🔥Specification:\nBrand: Huawei\nModel: P8 Lite\n\nNETWORK\t\nTechnology：GSM / HSPA / LTE\n2G bands：GSM 850 / 900 / 1800 / 1900 - SIM 1 & SIM 2\n3G bands：HSDPA 900 / 1900 / 2100\n4G bands：3, 7, 8, 20\nSpeed：HSPA 42.2/5.76 Mbps, LTE Cat4 150/50 Mbps\n\nBODY\t\nDimensions：143 x 70.6 x 7.7 mm (5.63 x 2.78 x 0.30 in)\nWeight：131 g (4.62 oz)\nBuild：Glass front (Gorilla Glass 3), plastic back, plastic frame\nSIM：Hybrid Dual SIM (Micro-SIM/Nano-SIM, dual stand-by)\n\nDISPLAY\t\nType：IPS LCD capacitive touchscreen, 16M colors\nSize：5.0 inches, 68.9 cm2 (~68.3% screen-to-body ratio)\nResolution：720 x 1280 pixels, 16:9 ratio (~294 ppi density)\nProtection：Corning Gorilla Glass 3\n\nPLATFORM\t\nOS：Android 5.0.2 (Lollipop), upgradable to 6.0 (Marshmallow), EMUI 3.1\nChipset：Kirin 620 (28 nm)\nCPU：Octa-core 1.2 GHz Cortex-A53\nGPU：Mali-450MP4\nMEMORY\t\nCard slot：microSDXC (uses shared SIM slot)\nInternal：16GB 2GB RAM\n\nMAIN CAMERA\t\nSingle：13 MP, f/2.0, 27mm (wide), AF\nFeatures：Dual-LED flash, panorama, HDR\nVideo：1080p@30fps\n\nSELFIE CAMERA\t\nSingle：5 MP\nVideo：720p\n\nSOUND\t\nLoudspeaker：Yes\n3.5mm jack：Yes\n\nCOMMS\t\nWLAN：Wi-Fi 802.11 b/g/n, Wi-Fi Direct, hotspot\nBluetooth：4.0, A2DP, EDR, LE\nGPS：Yes, with A-GPS, GLONASS\nNFC：Yes\nRadio：FM radio\nUSB:microUSB 2.0\n\nFEATURES\t\nSensors:Accelerometer, proximity, compass\n\nBATTERY\t\nType:Li-Ion 2200 mAh, non-removable\nStand-by\tUp to 380 h (3G)\nTalk time\tUp to 11 h (3G)\n\n🔥Package included:\n1 x Huawei P8 Lite Smartphone\n1 x Charger\n1 x Earpiece\n1 x USB Charging cable\n\n💎×××After Sales Service×××💎\nDear customer, Thank you for your support. \nIf any questions on operating, please feel free to contact us via \"Chat\".\nOperating Hours: Monday-Sunday, 11:00AM-9:00PM (Excluding Public Holiday)\nCross Asia.\n\n#huawei #P8 lite #smartphone #cell phone #android phone #mobile ",
        "brand": null,
        "discount": "66%"
    },
    {
        "name": "KING 🔥 Wall Mounted Organizer Storage Box Remote Control Bathroom Cosmetics  Storage Case, Mobile Phone Plug Holder Stand Rack estan",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5081749026&shopid=399446514",
        "org_price": "5.28-5.28",
        "new_price": "1.28-1.28",
        "desc": "Feature:\nSize: about 8.5X9X11.5 cm\nUse this convenient stand Always know the location of the remote\nConvenient to store mobile phone remote control, save space\nColor: White Gray Red Blue \nEasy to use, portable, practical, multi-purpose\nMaterial: ABS\n\n⚫DELICATE & SMOOTH \n Delicate details, smooth edge, comfortable hand feeling, protect from hurting. \nMULTI-PURPOSE STORAGE → Not only used for keeping the remote controls of TV or air conditioner within reach, but also used for storing mobile phone, writing pens, scissors, combs, toothbrushes, lipsticks and other small items. \n\n⚫SUITABLE FOR PLACES \nEasy to stick on walls, nightstands, counters, desks, doors, and other smooth surfaces, like metal, glass, wood, ceramic tile. \n\nUsing Method:\n1.Take two pieces of glue.\n2.Stick a piece of adhesive tape on the upper and lower ends of the back of the product.\n3.Remove the back glue on the adhesive.\n4.Stick to the wall and use it after 24 hours of inactivity.\n\n\n📦Package Included:1X storage box\n\n\nPLEASE NOTE: \n1. A little error might exist due to manual measurements, please kindly understand. \n2. Different light shooting and different displays may cause the color of the item in the picture a little difference from the real thing.\n\n\n\n\n#home #homeliving #homeandliving #homestorage #hook #homeware #stora",
        "brand": null,
        "discount": "76%"
    },
    {
        "name": "Luxury metal Mobile Phone Socket Holder Universal Telephone Finger Ring Holder Magnetic Car Bracket Stand Access",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7145311020&shopid=293279853",
        "org_price": "5.0-5.0",
        "new_price": "2.9-2.9",
        "desc": "Brand Name CELBRO\nCompatible Brand Universal\nCharger No\nModel Number Finger Ring Phone Holder\nUse Finger Ring Holder\nMaterial Metal\nHas Speaker No\nMagnetic No\nColor Grey / silver / gold / Pink\nType 1 finger ring phone holder magnetic car phone holder destop phone mount\nType 2 Ring for Phone,Finger\nType 3 Ring Holder,Cell Phone Holder,Finger Ring Holder\nType 4 Mobile Phone Holder,Support for Mobile Phone\nFeatures 1 Mini slim, portable,  360° free rotation, 180° reversible\nFunction Anti-lost, Can be used with any magnetic stand\nTips Ring Holder for Phone\nMaterial Metal\nFeatures 2 Support one-handed operation\nSupport Wholesale/Drop shipping/Mix Color\nSuitable 1 for Samsung Galaxy S20 Plus / S20 Ultra\nSuitable 2 for iPhone 11 Pro mAX\nSuitable 3 for Xiaomi Mi 10 Pro\nSuitable 4 for Huawei P40",
        "brand": null,
        "discount": "42%"
    },
    {
        "name": "[READY STOCK] Mobile phone bracket electroplating highlight pig ring buckle gift custom LOGO giveaway magnetic car phone h",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7108671495&shopid=201842067",
        "org_price": "2.0-2.0",
        "new_price": "0.8-0.8",
        "desc": "The phone ring holder is made of premium zinc alloy, which is ductility and abrasion resistance and can hold the ring firmly, no fading.\nThe phone ring stand can be attached to your cell phone or tablet tightly. Supports phones within 5kg.\nA perfect solution to place your smartphone on office desk, kitchen counter or bedside table when you are watching video, listening to music, making a video call etc. Totally free your hands.\n360° Rotation and 180° Flip make it more flexible and convenient to provide you with adjustable viewing angle and it can perfectly adapt to various occasions.\nThe metal plate can be well attached to the magnetic phone car mount, giving you safe driving experi",
        "brand": null,
        "discount": "60%"
    },
    {
        "name": "JBL Earphones REFLECT MINI NC True Wireless Smart Bluetooth Mobile Wireless Music Headset Binaural Stereo With Charging",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9874929560&shopid=163968017",
        "org_price": "56.58-56.58",
        "new_price": "28.29-28.29",
        "desc": "description:\n\nMaterial: ABS + electronic components\nSize: 6 x 3.5 x 3 cm (Due to manual measurement, there will be an error of 1-3 mm.)\nDrive unit size: 6 mm/ 1/4” moving coil drive unit\nPower supply: 5.0 V 400 MA\nHeadphone battery type: li-ion battery (50 MA/ 3.7 V)\nCharging box battery type: lithium-ion battery (300 MA/3.7V)\nCharging time: less than 2 hours from exhaustion to full charge\nMusic playback time when BT is turned on: up to 7.0 hours\nUp to 6 hours of music playing time when BT and active noise reduction are on\nFrequency response: 20 HZ-20 KHZ\nImpedance: 16 OHM\nSensitivity: 97 DB SPL @ 1KHZ\nMaximum SPL: 96 DB\nMicrophone sensitivity: -32 DBV/ PA @ 1 KHZ (TBC)\nBluetooth version: 5.1\nBluetooth specification version: A2DPV1.3, AVRCP V1.6, HFP V1.7\nBluetooth transmitter frequency range: 2.4 GHZ-2.4835 GHZ\nBluetooth transmitter power: <10 DBM(TBC)\nBluetooth transmitter modulation: GFSK, ∩/4 DQPSK, 8DPSK\n\n1.ANC active noise reduction: using active digital noise reduction and passive sound insulation technology, synchronous and accurate generation of opposite sound wave signals, focusing on low frequency bands, and efficient filtering of external noise.\n2.IPX7 waterproof/sweat-proof: work in harsh environments, not afraid of violent storms. Support high-intensity exercise, enjoy sweating like rain.\n3.High specification waterproof moving coil drive unit, lightweight multi-layer composite diaphragm, with high tension characteristics. The distortion is lower, the low frequency flexibility is sufficient, and the high-speed transient response allows a wide range of sound and audio, full dynamics, and balanced timbre.\n4.Bluetooth 5.1 dual-channel transmission, open the cover to connect entertainment and smooth wireless, the new generation of Bluetooth 5.1 true wireless chip, the transmission rate is increased to 24 MBPS.\n5.Intelligent custom touch: simple and efficient one-handed operation, the left and right units are equipped with touch buttons, no mobile phone is required, and one-handed operation is faster.\n\nParts List:\n\n1 Pair of earphones \n3 x Earplug sleeves \n3 x Winged reinforced earplugs\n1 x Charging case \n1 x M",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "Car Phone Holder Car Dashboard GPS Navigation Bracket Rearview Mirror Sun Visor Mobile Phone Stand 360º Rotating Foldable ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8948205230&shopid=129736267",
        "org_price": "4.99-9.99",
        "new_price": "2.89-5.29",
        "desc": "Features:\n1. Made of brand new ABS material, environmentally friendly and durable.\n2. Suitable for most mobile navigation models.\n3. It can be rotated 360°, and various visual angles can be adjusted freely.simple operation, practical effect.\n4. Four - claw card position, the phone is more stable and not easy to drop.\n5. The buckle structure is adopted, which is convenient for quick disassembly and installation.\n6. With foam (or soft glue) on the contact part of the mobile phone, it can effectively protect the mobile phone from being scratched.\n7. It can be fixed to car rearview mirror/instrument panel/sun visor.\n8. Can be placed with any place, a wider range of applications.\n\nSpecification:\nMaterial: ABS plastic\nColour: Black\nSize: As the picture shows\nNet weight: 111g\nApplicable mobile phone width: 4.8-10cm（3-6.5 inch）.\n\nPackage Included:\n1 x Car Phone Holder\n\n#PhoneHolder #CarPhoneHolder ",
        "brand": null,
        "discount": "47%"
    },
    {
        "name": "OPPO Reno 5/Reno 5 Pro 5G Mobile ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8319162151&shopid=52377417",
        "org_price": "599.0-899.0",
        "new_price": "472.0-615.0",
        "desc": "OPPO Reno5 5G\n(CPH2145)\nAI Highlight Video: Ultra Night Video + Live HDR\nDual-view Video\n65W SuperVOOC 2.0\nQualcomm® Snapdragon™ 765G\n90Hz Refresh Rate\nFor more details, kindly visit: https://www.oppo.com/sg/smartphones/series-reno/reno5-5g/specs/\n\nOPPO Reno5 Pro 5G\n(CPH2201)\nAI Highlight Video (Ultra Night Video + Live HDR)\nDual-view Video\n65W SuperVOOC 2.0\n3D Borderless Sense Screen\nMediaTek Dimensity 1000+\nFor more details, kindly visit: https://www.oppo.com/sg/smartphones/series-reno/reno5-pro/specs/\n\n- 2-year warranty\n- Strictly no returns or refunds allowed after purch",
        "brand": "OPPO",
        "discount": "32%"
    },
    {
        "name": "Montessori Gobbi Hanging M",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6345701451&shopid=241022015",
        "org_price": "-1e-05--1e-05",
        "new_price": "27.3-27.3",
        "desc": "The 3rd mobile of the Montessori Visual Mobile Series. From 2 months onward, babies can distinguish colors better and can gradually see the full color spectrum. The Gobbi mobile supports this visual development by introducing color gradations that refine baby’s chromatic sense. \n\nFor infants from 8 weeks+\n\nPurpose:\n\nDevelop chromatic sense.\n\nDistinguish between color shades. \nDevelop concentration and attention ",
        "brand": null,
        "discount": null
    },
    {
        "name": "3M Air Conditioner Flexible Exhaust Hose Tube Mobile Air Conditioner Window Vent Pipe Dia. ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=3543086261&shopid=33213512",
        "org_price": "14.55-14.55",
        "new_price": "8.9-8.9",
        "desc": "Name: 3M  5\"/12.5cm Flexible Exhaust Vent Hose \nModel: A03223\nSpecifications:\nColor:?White+Silver\nMaterial:?PVC+Aluminum Foil\nDiameter: 12.5cm / 5\"\nLength: 3M / 118\"\n\nFeature\n- This product can be bent at 360° and freely stretched.\n- With high flexibility, friction resistance, and acid corrosion resistance.\n- For draining , moisture, dust, high temperature gas, powder and so on.\n- Widely used in industrial ventilation, range hoods, exhaust fans, and ventilation of other electrical equipments.\n\nPackage include:\n1 x Exhaust Hose\n\nNotice:\n1.Please allow 1-5mm error due to manual measurement. Please make sure you do not mind before you bid.\n2.The colors may have different as the difference display, please unders",
        "brand": null,
        "discount": "39%"
    },
    {
        "name": "Montessori Octahedron Hanging M",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5545719662&shopid=241022015",
        "org_price": "-1e-05--1e-05",
        "new_price": "20.9-20.9",
        "desc": "The second part of the Montessori Visual Mobile Series. This mobile introduces primary colors just as your baby is developmentally ready to perceive them. Primary colors have enough contrast between them that a young baby can see the difference (unlike a design that combines blue and purple). The geometric shapes of this mobile are made up of equilateral triangles and encourages babies to coordinate use of their two eyes together, while also continuing exposure to mathematical concepts.\n\nFor infants from 5 weeks+\n\nPurpose:\n\nExpose babies to the concept of geometry, shapes and patterns.\nDevelops visual sense.\nBuilds concentration and attention ",
        "brand": null,
        "discount": null
    },
    {
        "name": "Niimbot B3S Label Printer inkless IOS Bluetooth hot portable mobile phone printe",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5949161999&shopid=296096293",
        "org_price": "40.0-144.0",
        "new_price": "18.4-84.9",
        "desc": "📌Attention: The printer does not contain label paper, label paper needs to be purchased separately\n📌Support printing receipt paper with width less than 75mm\n\n📌Quick Details\nStyle:Black\nInterface Type:Bluetooth / USB/ Other connection\nResolution:203dpi\nBrand Name:Niimbot\nModel Number:B3S\nPlace of Origin:China\nProduct name:B3S Bluetooth thermal label printer\nPrinting Method:Thermal printing\nColor:Black\nPaper type:Thermal Paper\nPaper width:20-75mm\nSupport System:Android+iOS+Window+PC\nPrinting Speed:30-60mm/s\nRechargeable battery:Lithium-Polymer battery ( 2200mAh )\nPrinting contents:Text / Line/Excel ( JPG, BMP, TIF, JPEG )\nApplication:home,store,business,gift,retail\n\n【Features】\n🔴No ink、Without carbon belt\n🔴Thermal Technology、Bluetooth Direct Connect\n🔴Free editing template、Image recognition，voice recognition.\n🔴thousands of templates, more convenient and fast operation.\n🔴Built-in battery、Batch printing、Continuous printing\n\n【Application】\n✅Multi-scenario application to easily meet your various needs\n✅Commercial scene: clothing store label, jewelry store label, supermarket convenience store label, bakery store label\n✅Home scene: Switch label Kitchen label Cosmetic label Learning label Name sticker\n\n💗【Machine Highlights】\n1. Imported print head with unique thermal printing algorithm, clear printing.\n\n2. Modulus sweep the yard, smart identification template, more convenient and fast operation.\n\n3. Three intelligent recognition inputs\n\n①Speech recognition, you can type, label, or speak\n\n②Picture to text, the picture is automatically converted to text with high accuracy\n\n③Scan code recognition, convert the scanned barcode content into text or barcode and copy to APP\n\n4. Bluetooth link, get rid of the \"wire\" system, compatible with ios, Android, tablet, PC and other devices\n\n5. Rich content, one \"print\" is complete, diversified printing content, logo, time, one-dimensional code, two-dimensional code, picture, line, Chinese, English, Japanese and Korean and other languages\n\n6. Rich industry templates, one-click editing and printing, thousands of industry templates built in the APP can be directly called, no typesetting, and support for saving custom templates\n\n7. Batch printing, efficient and intelligent, importing forms and printing multiple labels at once\n\n8. You can take it with you anywhere, it is small and portable, the real face value strength\n\nProduct content: \nlabel printer x1, \ncharging cable x1, \nmanual x1\n#B3s label printer#handheld#Bluetooth#thermal#price tag sticker#barcode#QR code#jewelry price#niimbot pr",
        "brand": null,
        "discount": "54%"
    },
    {
        "name": "(Ready Stock) UV Mobile Phone Film Curing Lamp UV LED Portable UV Nail Lamp Dryer Mini Folding Double-sided Fast Bonding Resin Jewelry Making Sup",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6957087317&shopid=321814893",
        "org_price": "6.89-6.89",
        "new_price": "2.05-2.05",
        "desc": "Ready Stock! Ready Stock! Ready Stock!\n\ndescription:\n* 1. Material: PVC\n* 2. White color\n* 3. Lamp: 3\n* 4. Power capacity: 6 W\n* 5. Power supply: USB\n* 6. Size: 95*30*10mm\n\nfeature:\n* 1. Built-in 3 lights can completely cover the lighting area.\n* 2. The lamp is mainly used for nail polish, curing mobile phone screen protective film, etc.\n* 3. Compact, lightweight, portable and easy to store.\n* 4. The folding stand is easy to use and store.\n* 5. Powered by USB, the UV lamp can be connected to a mobile power supply or computer for power supply.\n\nThe package includes:\n1 x UV ",
        "brand": null,
        "discount": "70%"
    },
    {
        "name": "Mini USB Thermometer Mobile Phone Digital Thermometer With LED Display Non-contact Infrared Temperature Sensor Type-C Hygro",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5581613948&shopid=401297909",
        "org_price": "19.99-19.99",
        "new_price": "4.99-4.99",
        "desc": "Features:\n1. Upgraded sensing probe, more accurate measurement.\n2. Portable thermometer: Weighs about 12.5g, light and thin, convenient and easy to carry, and the measurement can be easily completed in 0.5-1s.\n3. You can switch °C/°F with one click, and the thermometer can be used for different reading habits.\n4. Safe and hygienic: Non-contact design, only need to aim the forehead, 3-5 cm away from skin, without touching the skin, safer and more hygienic when using it for different people.\n5. High temperature reminder: Red light is displayed above the temperature. When the temperature is too high, it will beep, easy to use and rest assured.\n6. Equipped with pyroelectric sensor, can be connected to mobile phone and can be quickly measured in one second. The LCD screen clearly displays temperatue value, an accurate thermometer.\n\n\nSpecification:\nName: Mobile Phone Thermometer\nModel: K8\nPower: DC 5V\nMonitoring temperature range: 32°C--42°C\nTemperature setting: °C/°F\nTemperature tolerance: ±0.2°C\nMeasuring distance: 3-5cm\nEnvironmental conditions: 10°C~35°C\n\n\nPacking List:\n1 * Thermometer\n1 * Manual\n\nNote:\n1. Due to manual measurement, there may be a slight tolerance in size.\n2. Due to difference in light and displays, there may be little color differ",
        "brand": null,
        "discount": "75%"
    },
    {
        "name": "HOT among us New game lanyard card set combination mobile phone pendant game peripheral key",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4569526441&shopid=178578477",
        "org_price": "5.78-8.0",
        "new_price": "1.41-2.76",
        "desc": "welcome to greencentury1.sg store\nColor: single card holder, blue lanyard with black head + card holder combination, blue lanyard with silver head + card holder combination, blue hand rope with black head + card holder combination, blue hand rope with silver head + card holder combination, yellow hanging Rope black head + card holder combination, yellow silver head lanyard silver head + card holder combination, yellow hand rope black head + card holder combination, yellow hand rope silver head + card holder combination\n\nMaterial:Polyester\nThank you for visition greencentury1.sg store\nPlease note that this product has a hand strap and a lanyard. The price of the hand strap is lower than the price of the lan",
        "brand": null,
        "discount": "76%"
    },
    {
        "name": "Nokia 1100 Basic Phone Mobile Phone Keypad Cell phone Black And White Screen GSM Function Hand",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5674385004&shopid=369219131",
        "org_price": "26.4-26.4",
        "new_price": "15.99-15.99",
        "desc": "Specifications:\nModel: Nokia 1100\nScreen size: small screen (less than 4.0 inches)\nUnlock Phones: Yes\nStandby Time: Up To 72 Hours\nPhone Type: Feature Phones\nCamera pixel: less than 5 million\nShape: straight\nROM: <128M\n\n3.5mm Headphone Port: no\nSIM Card Quantity: 1 SIM Card\nCPU Core Quantity: Single Core\nCellular: GSM\nScreen Material: TFT\nFast Charging: Nonsupport\nNokia Model: 1100\nFront Camera Quantity: NONE\nMain Rear Camera  Sensor: Other\nThickness: Normal(>10mm)\nRAM: <128M\n\nDisplay Resolution: 480X320\nBattery Capacity(mAh): Li-Ion 850 mAh battery (BL-5C)\nCamera Type: NO Camera\nSize: 106 x 46 x 20 mm\nSIM Card Quantity: Single SIM Card\nTalk Time: according to usage\nDisplay Color: Black \nBand Mode: 1SIM/Single-Band\n\nPackage included: \n1 pcs * Mobile phone\n1 pcs * Battery\n1 pcs * AC Charger\n1 pcs * Box pa",
        "brand": null,
        "discount": "39%"
    },
    {
        "name": "Universal Car Mobile Phone Holder / Non-slip Dashboard Mounted Phone GPS Holder / in Car Smartphone Stand / In Car Phone Bracket For iPhone And Android ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6154498459&shopid=157025663",
        "org_price": "6.55-6.55",
        "new_price": "1.77-1.77",
        "desc": "Welcome ILOVEDIY Brand Store\n\n1,What our aiming at? \n★ Perfect product: popular & practical & inexpensive.\n★ Fast delivery: ready stock & 1 day shipped out.\n2,Better consumer protection \n★ Full refund if you don't receive your order.\n★ Full or partial refund , if the item is not as described.\n\nProduct description:\n[ Universal Car Mobile Phone Holder ] [Car Non-slip Dashboard Mounted Phone Holder] [In Car Phone Bracket For All Phone]\n\nDismantle at will, carry at will, use at will\nDurable, can be used repeatedly, can be washed repeatedly, will not age, its fixing power, elasticity, and effect are unchanged\nExcellent field of view of 120 degrees, ergonomic safety perspective, turning mobile phone into a professional navigator\n\nProduct name: non-slip car phone holder\nInstallation method: card slot type\nComponents: a large non-slip mat + two bracket buckles\nSize: (approx.)\nLarge non-slip mat: 11CM*9CM\nFrame buckle: 5CM*4CM\nMaterial: Silicone\nColor: black/orange/blue/red\nUse scene: car dashboard, desktop\nquantity: 1\n\nPackage includes: 1 x mobile phone holder\n\n★ Free gifts: Any separate one package will have a randomly Gifts in it ,Hope you will like it!\n★ Note:due to the light and screen difference, the item's color may be slightly different from the pictures. please understand and please allow some differences due to manual measurement.\n★ Dear friend:you may find that someone sells at a lower price than us but they cannot guarantee the same quality and service as we do,Please Believe us And Follow our store.thank you so much!\n\n\n#ILO",
        "brand": null,
        "discount": "73%"
    },
    {
        "name": "TANKE Bicycle mobile phone bracket aluminum alloy Universal oil slick 360° rotating more stable for MTB road bike and motorcycle navigation ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=2927267489&shopid=362584181",
        "org_price": "22.88-22.88",
        "new_price": "16.8-16.8",
        "desc": "Product Name: aluminum alloy 360 ° rotary mobile phone holder\nColor: colorful\nMaterial: aluminum alloy\nFixed way: quadrilateral claw + expansion screw + bottom support\nProduct size: about 85mm long, about 55-100 mm wide\nSuitable for mobile phone: the width of mobile phone is 56-96mm\nClamp diameter: suitable for 22.2-31.8mm diameter straight shank\nPackage includes: mobile phone bracket, silicone patch, hex",
        "brand": null,
        "discount": "27%"
    },
    {
        "name": "INS STYLE Phone Sticker Korean Tassel Metal Hook DIY Accessories Heart Shape Square Buckle Mobile Phone",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8343443413&shopid=142360582",
        "org_price": "1.67-1.67",
        "new_price": "0.86-0.86",
        "desc": "Package Included: 1 X Metal Hook DIY Accessories\r\n\r\nProduct Description\r\nProduct number: Horsetail heart-shaped\r\nType: Pendant\r\nTexture of material: Metal alloy\r\nTreatment process: electroplate\r\nArticle number: heart-shaped a hook\r\nPlace of Origin: Guangzhou\r\nBrand: Pete\r\nColour: heart-shaped golden,heart-shaped silvery,heart-shaped black,Square Gold,Square Silver,Square black\r\nModel: currency\r\nIs cross-border export dedicated to the source of good",
        "brand": null,
        "discount": "49%"
    },
    {
        "name": "Wall Mounted Toilet Paper Holder/ Waterproof Tray Toilet Roll Tube Mobile Phone Storage Rack/ Punch-Free Home Supplies Phone Rack",
        "link": "https://shopee.sg/api/v2/item/get?itemid=3045937073&shopid=157025904",
        "org_price": "15.13-15.13",
        "new_price": "4.19-4.19",
        "desc": "🎉🎉Welcome🎉🎉\n-----------------------------------------------------\n✨✨✨Product detail ✨✨✨\n→Product conditon:100% Brand New\n→Product production date:Recent production(Within 2 weeks)\n★Product Description：\nPunch-free toilet tissue box plastic roll holder toilet bathroom tissue box pumping box tissue holder\nProduct Name: Multifunctional Waterproof Tissue Box\nColor: purple, red, gray, blue\nInstallation method: nail-free and traceless glue\nFeatures: T-shaped paper outlet, sawtooth paper break, easy to use, waterproof and moisture-proof\nMaterial: Plastic PP\nSize: 13.1*13.6*15.7cm\nquantity: 1\nThe package includes:\n1*tissue box\n-----------------------------------------------------------------------\n★★★ Best Service★★★\n👉Fast Shipping\n→ Ready stock !\n👉 Buyer Protection\n→ Full Refund if you don't receive your order!\n→ Full or Partial Refund , if the item is not as described!\n👉 Dear Friend! You may find that someone sells at a lower price than us but they cannot guarantee the same quality and service as we do.thank you!\n---------------------------------------------------------------------------------------------\n★★★ Contact Us ★★★\n\n✨Dear Friend:The description of the product is written by English,if you can not read it well please contact us ! We will Respond you ASAP !\n✨Note:due to the light and screen difference, the item's color may be slightly different from the pictures. please understand. please allow some differences due to manual measure",
        "brand": null,
        "discount": "72%"
    },
    {
        "name": "Creative Elephant Mobile Phone Holder Creative Mobile Phone H",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8447517472&shopid=186976077",
        "org_price": "2.55-2.55",
        "new_price": "1.18-1.18",
        "desc": "🌿🌿Welcome🌿🌿\r\n\r\n\r\n💗💗Product details💗💗\r\n\r\nName: elephant mobile phone holder\r\nType: lazy bracket\r\nColor: 3 colors random\r\nSize: (6.5x2.7x4.2) cm\r\nMaterial: plastic\r\nWeight: 8 g\r\n\r\nNote:\r\n\r\n1 our products are taken by professional photographers, and the color difference is inevitable because of the different light, display configuration and personal understanding.\r\n\r\n2 because of international transport, individual products may be defective because of violent transport.\r\n\r\n3. please take photos first when you receive the g",
        "brand": null,
        "discount": "54%"
    },
    {
        "name": "Anti-Fall Case VIVO Y19 Y91 Y93 Y97 Case VIVO Y83PRO V7 + Y85 Y79 Y66 Y67 Y55 Shockproof mobile phone",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7637758894&shopid=272918169",
        "org_price": "11.99-11.99",
        "new_price": "5.99-5.99",
        "desc": "1.Material：High quality TPU   outer PC.\n2.Function: Anti-Skid  Dirt-resistant Shock-Proof Scratch-Resistant shatter resistant Anti-knock.\n3.Function : Kickstand.\n4.Stylish look   practical design.\n5.Protect your love machine from scratches and damage.\n\nCompatible brands:VIVO\n\nNeed other suitable models, please CHAT\n\nWelcome to wholesale negotiations, give discount sup",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "Shower Phone Holder Bathroom Rack Mobile Phone Holder Wall-Mounted Punch-Free Bathroom Shower Shower Binge-watching Waterproof Storag",
        "link": "https://shopee.sg/api/v2/item/get?itemid=10314026128&shopid=463991768",
        "org_price": "9.0-18.0",
        "new_price": "4.32-8.64",
        "desc": "#Shower Phone Holder#\n\nWelcome to our store! ! !\n\nWe're not only cheap It's beautiful! ! !\n\nLimited time offer Give small gifts! ! !\n\nAll in stock!!!\n\nWe'll buy it from you24Delivery within 24 hours ！！！\n\n*iPhone Skin sensation Lens protection Mobile phone set*\nMaterial：Plastic\nInstallation：Wall-Mounted Hole-Free\nUse Object：Mobile Phone\nStyle：Northern European-Style\nFunction Characteristics：Waterproof,Moisture-Proof,Rotat",
        "brand": null,
        "discount": "52%"
    },
    {
        "name": "HelloKimi Educational Toy Phone Rechargeable Learning Mobile Phone Toys Baby Kids Puzzle Phone English Learning Phone Toy with Music LED for Kids Intelligent",
        "link": "https://shopee.sg/api/v2/item/get?itemid=3458979446&shopid=284950544",
        "org_price": "12.22-12.22",
        "new_price": "6.09-6.09",
        "desc": "Welcome to HelloKimi ----- a Toy World. We have Various Toys, which are Best Gifts for Kids.\n\n\n❤ Product name: Educational Toy Phone\n\n❤ Product material: ABS\n\n❤ Color: Black/White/Blue/Purple\n\n❤ Product weight: 32g\n\n❤ Product size: 12.5*6*0.8cm\n\n❤ Product packaging: 1×Toy Phone, 1×Cable\n\n\n✔【Beneficial to Children's Intelligence】- Train children hand-eye coordination skills, logical association and musical potential.\n\n✔【LED Lights】- Lights flash in multicolors around the edges when a button is pressed, very visually stimulating.\n\n✔【8 Modes】- The Phone Toy feeds your child’s curiosity to learn through touch, sound and sight Boasts 8 different modes and plenty of sound effects.\n\n✔【Voice Function】- When you flip the switch, it will ring and when you press the picture on the phone, it will s",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "Wall Mounted Organizer Remote Control Storage Case Mobile Phone Plug Holder Stand Cont",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7584979436&shopid=74652209",
        "org_price": "2.75-2.75",
        "new_price": "1.65-1.65",
        "desc": "Specifications:\r\nUses: Remote Control, Mobile Phone, Cosmetics, Sundries Storage Box\r\nColor: Green / Yellow / Blue \r\nMaterial: Abs Material\r\nSize: 9*5*10Cm (Long / Wide / High)\r\nPackage Included: 1Pc Wall Mount Storag",
        "brand": null,
        "discount": "40%"
    },
    {
        "name": "Garena 200 Shells (Instant delivery) (Available on Desktop or \"Desktop Mode\" on Mobile only from 9th April ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=967459952&shopid=58853808",
        "org_price": "6.0-6.0",
        "new_price": "5.4-5.4",
        "desc": "(Available on Desktop or \"Desktop Mode\" on Mobile only from 9th April 2020).\r\n\r\nHow to Purchase\r\n\r\n1. Order Shells from Garena Official Store\r\n2. Pay with Credit Card or Bank transfer only\r\n3. Get your code via in-app Push Notification under \"Shopee Updates\"\r\n\r\n- Payments can only be made via bank transfer/credit card payments only\r\n- No return/refunds are allowed.\r\n- No vouchers can be used on this product.\r\n-  Each User can only purchase 3 of the Garena 200 Shells a month.\r\n- Validity: Until 04/08/2022\r\n\r\nHow to Redeem After Purchase?\r\n1. Go to this link: https://shop.garena.sg/app\r\n2. Click on Shell Top Up \r\n3. Click on Garen",
        "brand": null,
        "discount": "10%"
    },
    {
        "name": "Ankndo Car Phone Mount Dashboard Car Phone Holder 1200 Degree Rotation Adjustable Mobile Cell Phone Clip Mount Stand Suitable for 3-7 Inches Smartphones GPS Navig",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4069496617&shopid=340306593",
        "org_price": "18.29-28.88",
        "new_price": "7.32-9.99",
        "desc": "✅【All goods are in stock】\n💁【We ship within 24 hours of your order】\n🚚【You can receive the package within 5 to 10 days】\n\nProduct Features\n🔅Unique Design--This cell phone mount has a special clip design, which has double presser foot spring, 360 degree rotation. And 180°horizontal angle rotation, you can adjust the car phone holder at the best viewing.\n🔅Wide Application--Our cell phone holder can be used in car dashboard, sun visor, rearview mirror, and home desk.\n🔅Safe Driving--The cell phone holder adopt HUD simulating design. you needn't to look down at the screen, just be a eye-level then you can get a best view of the road, ensuring your safe driving while your are GPS or talking, navigating, listening to music or charging.\n\nSpecifications:\nMaterial : ABS+ Silicone\nColor: Black\nProduct name: Multifunctional mobile phone holder\nProduct Size: 8cmx13cmx11.5cm\nSuitable for mobile phones : Universal 3-7 inch mobile phone\nApplicable location: Car dashboard/sun visor/rearview mirroroffice computer desk\n🚩🚩The updated version has number plate card.\n🚩🚩The video is for  updated version Holder.\n\nNote⬇:\n1. All items are available, please rest assured to place order.\n2. Sizes indicated are mostly estimated.\n3. Posted photos are actual photos of the items.\n4.If you place order,we will process it within 24 hours,you will get your parcel about 5-15 days\n\nPackage Included:\n1 x Multifunctional mobile phone h",
        "brand": null,
        "discount": "65%"
    },
    {
        "name": "🎉Ready Stock🎉 Bedside Table Ultra-narrow Mini Mini Crevices To Close Bedside Cabinet Mobile With Wheel Lock Simple Modern (20x40x",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5843761661&shopid=266724016",
        "org_price": "42.0-65.0",
        "new_price": "21.0-35.0",
        "desc": "🎉🎉🎉 Welcome! 🎉🎉🎉 \n\n●●●●●●●●●●●●●\n\n⭐CN Fujian seller\n\n⭐Collect coupons based on store\n\n⭐ 100% quality new premium\n\n⭐Packaging and delivery can be delivered within 21 days (including weekends)\n\n⭐ Delivery time 11-25 days 🚀\n\n⭐New gift box🎁\n\n●●●●●●●●●●●●●\n\n⭐About after-sales service ✈\n⭐ Delivery time is about 2 weeks.\n⭐Before receiving the goods, please be sure to open the package and check\n⭐If the outer box is damaged, please do not sign.\n⭐If the product is damaged or there are other quality problems, please contact customer service.\n⭐Provide outer packaging and product pictures, we will solve the problem for you as soon as possible.\n⭐Customer service time: 9:00-21:00\n⭐1. Scope of delivery in Singapore\n⭐(1) Delivery can be made throughout Singapore.\n⭐(2) If you can use the elevator to transport the goods directly to your door, there will be no additional costs. The weight of the cargo should be within the carrying capacity of the trolley, and the weight of a single item must be less than 50 kg.\n⭐(3) If there is no elevator in the building or the items cannot be sent to the elevator, the porter will charge a fee of S$35 for two people, and an additional S$13 per floor. The weight of a single item must be less than 50 kg. If the oversized cargo cannot enter the elevator and corridor, you need to communicate with the on-site delivery staff to negotiate the price of the upstairs service.\n⭐(4) Ceramic tile panels can only be shipped downstairs or in the designated unloading area. If the goods need to be transported upstairs, it will cost you S$20 per hour without damage compensation.\n⭐(5) If the second delivery is caused by the customer, an additional $35 will be charged for each order.\n⭐(6) If you need delivery personnel to wait, the waiting time should be within half an hour (30 minutes).\n⭐(7) If you need to change the address, you must operate on the platform before shipping.\n\n⭐2. Disclaimer: Furniture is a large product and needs to be shipped by sea. The product may be damaged during transportation. Our shop does not accept unreasonable returns. If you mind, please purchase with caution, please understand.\n\n⭐If parts of the product are damaged and cannot be used normally, we will resend new parts for you. . Thank you! Please keep in mind that we will use sea shipping to ship your items. Customers usually receive your order within 3-4 weeks. Thanks!\n\n●●●●●●●●",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "REMAX Desktop Mobile  Phone Holder Stand RM-C08 Compatible with Tablets Mobile Smart Phones SmartP",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8964897380&shopid=32228742",
        "org_price": "35.9-35.9",
        "new_price": "23.4-23.4",
        "desc": "🌟Take Note🌟\nSelf collection address is at:\n\nCanberra Plaza\n133 Canberra View\n#02-12\nS750133\n\nREMAX Desktop Mobile  Phone Holder Stand RM-C08 Brand: Remax\nColor: black, white\nSpecifications: Support 4 inch to 13 inch devices\nProduct material: ABS+aluminum alloy+silicone+PP\nProduct process: injection molding, oxidation\nProduct scope of application: mobile phones and tablets\nFinished product size (mm): 32*15.3*14.2\nProduct package details: bare metal + packaging + wiring + manual + certificate\nProduct selling points:\n-Both 4-inch mobile phones and 13-inch tablets can share this bracket\n-The lifting height can be adjusted to your own suitable height\n-The aluminum alloy has high resistance to grinding during the lifting adjustment process\n\n*We typically process orders on the same or next working day (excluding weekends and public holidays).\n*Courier takes 3 to 4 working days, while Singpost Normal Mail takes about 3 to 5 working days. Take note that Singpost Normal Mail may take up to 2 weeks in some instances, and is delivered directly to your mai",
        "brand": null,
        "discount": "35%"
    },
    {
        "name": "[SG SELLER] Car Headrest mobile holder Vehicle hp phone mount rear pillow support degree adjusting flexible back",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5888116410&shopid=140266",
        "org_price": "-1e-05--1e-05",
        "new_price": "4.9-4.9",
        "desc": "Vehicle flexible mobile holder\n\nColor: Black\n\nPhone/Tablet clip scale: 11.5-19cm/4.53-7.48inch (Approx.)\n\nApplied device: device of 4-12 inch\n\nApplication scenarios: Vehicle mounted rear pillow \n\nSuitable for mobile phone/tablet/GPS/PDA\n\n360 degree Rotating Joint\n\nMade of high quality ABS material, durable and strong.\n\nEasy to install and release on vehicles Back Seat -- No suction cup, no sticky pad necessary and no tools required.\n\nFit the cell phone&#39;s length or tablet PC&#39;s width from 11.5cm to 19cm (4-12 inch).\n\nBuilt-in anti-skid silicone, protects your device from scratch and accidental falling off.\n\nFully adjustable with 360 degree rotation for optimal viewing.\n\n🔎Where to find us? \n☎️ 91814105\n🗺️ The Commerze@Irving, #05-03,1 Irving Place, S369546\n🕙 Opening Hours: Mon-Fri: 10am-7pm, Sat-Sun: 10am-6pm\n(Mon-Sun Avoid Lunch 2-3pm)(Closed on Public Holidays)\n\n💁 Who are we? iPassion Group Pte Ltd (GST Registered 201511854Z) founded in 2015 started from a home-based business in 2007. Over the years, we have grown, now offering a wider array of products and services. Be that as it may, we remain true to our roots, upholding our core business model to provide you with affordable prices and top-tier service. Looking forward to deal with",
        "brand": null,
        "discount": null
    },
    {
        "name": "Kiwifotos Mobile Phone Wireless Remote Shutter Release for Width 59-85mm Smartphone, Phone Shooting Grip for Selfie, Vlog &",
        "link": "https://shopee.sg/api/v2/item/get?itemid=10912730984&shopid=375873370",
        "org_price": "23.0-23.0",
        "new_price": "21.85-21.85",
        "desc": "Designed for Vlog shooting, live streaming, taking selfies or group photos\nAdjustable clamp range between 59-85mm / 2.3-3.3\"\nComes with a detachable 10m / 32.8' wireless remote control\nProvide comfortable hand feeling and better shooting experience: silicone wrapped grip makes it easy to hold and operate smart phones in one hand, grips your phone like a camera and reduces shaking when taking photos or recording videos\nTop cold shoe mount allows to mount external LED lamps or microphones\nThe 1/4\"-20 female thread on the bottom enables to mount the grip on a stand or tripod\nThe anti-slip pads on the phone holder can better protect your phone, making it away from scratches\nThe phone grip can be positioned upright for self-standing portrait mode\n\nPackage Includes\nPhone Grip x 1\nDetachable Wireless Remote Control x 1\nCR2025 Battery x 1\nLanyar",
        "brand": null,
        "discount": "5%"
    },
    {
        "name": "Multifunctional Mobile Phone Live Support Folding Computer Lazy Tablet IPad Desktop Bedside ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6547035681&shopid=290121531",
        "org_price": "39.01-39.01",
        "new_price": "19.99-19.99",
        "desc": "❤️Maybe our price is not the lowest, but the quality of our products will not let you down ❤️\n①Welcome to our factory outlet store！Hope you have happy shopping！Please Follow Us to get extra followers Discount \n②Your 5 stars is the best support to our store!（Any problem pls contact us 1st, pls dont give bad rating）\n③We are a high quality store, We will always provide the best quality and service ! Please feel free to buy!\n\n【Instructions for return】\n🔸Please check again before the next single purchase of size, color, style, size and so on confirmation and then carry out orders to avoid trouble on your subsequent replacement\n🔸Expected to arrive in about 6 days at the soonest.\n🔸As long as the product has defects / wrong delivery / other problems, please inform us at the first time, we will arrange for you to deal with it as soon as possible.\nFrom now on, regardless of the amount\nJust press ☛ \"Follow\" and ☛ any product and press \"❤️\" (Remarks at the order place)\nSend a mysterious little gift with the package (✿◖◡◗)\n✌Thank you for your support✌\n\nMaterial: PC+metal\nApplicable size: 4-12.9 inch screen\nMobile phone clip width: 12.3+7 (stretched width) cm\n\n1. Reserve a charging port\n2. Alloy bracket, metal spring, strong load-bearing\n3. Wide compatibility, applicable to mobile phones and tablets\n\n💕If the goods and services satisfy you, please give us five stars + pictures and text evaluation encouragement. Next time repurchase, give us screenshot evaluation, and give preferential discount p",
        "brand": null,
        "discount": "49%"
    },
    {
        "name": "Car dual-purpose mobile phone holder / ring bracket / ring buckle bracket / folding phone h",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6313293024&shopid=211488588",
        "org_price": "6.0-6.0",
        "new_price": "4.8-4.8",
        "desc": "Two-in-one New Design: There is no magnet in this\n\nsmart-phone car mount air vent universal holder, which is 10 times\n\neasier to use than any other magnetic car mount holder due to its simple\n\nand complementary design. Two conversion modes for phone holder and car\n\nmount holders. Your best choice ever!\n\nMultiple-angle Car Phone Mount:Designed with 360°\n\nRotation and 90° Flip Folding. The mobile phone is horizontal/vertical\n\nfreely rotating, flexible and adequate, which meets the requirements of\n\ndifferent perspectives needs. This product will always ensure your\n\nsmartphone is in your preferred location whenever you are talking,\n\nnavigating, listening to music or watch movies.\n\nHigh Quality Materials:This product consists of a\n\nzinc alloy, a gear, a silicone serrated clip, the internal construction\n\nof gear is featured with eighteen gear snaps, which has largely\n\nguaranteed that the phone is in a very stable state from any angle,\n\nprotecting your phone from road vibration or issue. Unique silicone\n\nserrated clip design allows it to be mounted on car air vent for better\n\nGPS navigation.\n\nCar Vent Cell Phone Holder:Adhesive can be firmly\n\nattached to the phone to prevent the phone from falling. Simple\n\none-handed operating, easy to install on car vents in 10 seconds.\n\nSafe driving:Handheld phone conversations and\n\nhandheld GPS navigation (dangerous). Free your hands and make GPS and\n\nphone more convenient and protect yourself.\n\nSpecifications:\n\nMaterial: Zinc alloy\n\nColor: Black, Red, Blue, Gold, Silver\n\n\nSuitable for all models of mobile phones\n\nPackage Included:\n\n1x Mobile Phone Br",
        "brand": null,
        "discount": "20%"
    },
    {
        "name": "USB three for one charging cable / compatible / Type-c / Apple / Android mobile phone charging ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4013290729&shopid=211488588",
        "org_price": "8.0-8.0",
        "new_price": "5.8-5.8",
        "desc": "All our products are of high quality and we will try our best to provide you with the best service.\nFeatures: USB three for one charging cable.\ncompatible ; Type-c / Apple / Android mobile phone charging cable.\nAvailable; Oppo.Vivo.Huawei.Honor.Xiaomi.Redmi.Samsung.Apple iPhone.OnePlus.Google Pixel.Nokia.Lenovo?\nMaterial: Aluminum box + TPE.\nFunction: data transmission and fast char",
        "brand": null,
        "discount": "28%"
    },
    {
        "name": "Economical and Practical Mobile Phone Bracket, Retractable and Multi Angle Adjustable Portable IPad Tablet Br",
        "link": "https://shopee.sg/api/v2/item/get?itemid=3390593069&shopid=449635352",
        "org_price": "30.0-30.0",
        "new_price": "15.0-15.0",
        "desc": "type: Lazy man bracket\nApplicable brands: All mobile tablet brands\nApplicable model: All tablet models\nApplicable scenarios: Office desk bedside\ncolour: silvery,golden,black,rose gold\nSingle weight: 0.26kg\nMaterial Science: aluminium alloy+ABS\n\"Welcome to our store\"\n\n[purchase instructions]\n\nThe goods have been checked before delivery, but sometimes you will receive incorrect delivery and quality problems. Please let us know as soon as possible to help you. This shop is very responsible\n\nIf you are satisfied with our products and services, please give us five-star praise! If you are not satisfied, please talk with me\n\nWe will always contact you on",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "🌈Ready Stock🥰 Mobile Phone TPU Anti-fall Glue Cover For 11 XS XR X 8 7 6 Plus Mini Soft Cute Cartoon Soft Shell For iPhone 12 Pr",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9660615889&shopid=445539691",
        "org_price": "7.98-7.98",
        "new_price": "3.99-3.99",
        "desc": "🌈Welcome to Yibiao.Mall\n🌈Follow our store to receive coupons!\n\n✅Our shop focuses on providing the highest quality products at the most cost-effective price, please rest assured to buy!\n✅All products in this shop are 100% brand new and high quality.\n✅ All products are in stock.\n✅ Shipped within 2 day after ordering.\n✅Follow us + 5 star screenshot review, you can get an additional 10% discount next time you order (get discount coupons via chat).\n✅Customer service online time (09:00-22:00)\n\n>100% brand new high quality shell.\n>Fashion shockproof and anti-drop cover.\n>Protect the surface from scratches, dust, fingerprints.\n>Durable and washable.\n>Protect you from dust, scratches and vibrations.\n>Protect your valuables from scratches and damage.\n>For other colors or models, please contact customer service.\n\n🥰Applicable models:\nApple6/6S,Apple6P/6SP,Apple7/8,Apple7P/8P,AppleX/XS,AppleXR,AppleXSMAX,Apple11,Apple11Pro,Apple11Pro MAX,Apple12mini,Apple12,Apple12Pro,Apple12Pro MAX\n\n🥰Cover texture: soft rubber\n🥰Style: All-inclusive，Anti-fall\n\n🥰Package Included:\n1 x mobile phone case(No include Phone).\n\n😘Welcome to group purchase, wholesale, as long as there is quantity, the price is the lowest!!\n\nreceiving your order：\n🚚We ship from China，it usually takes 7-15 days to arrive.\n💥If you have any questions about the goods you received, please contact us, please do not give us one star at will, we will be very sad.\n\n#Soft #Silicone #TPUCASE #Case #Cover #iPhone8 #iPhone #iPhone6plus #iPhone7 #iPhone7Plus #Apple #iphone11case #iphone11procase #iphone11promaxcase #iPhone8Pluscase #iPhoneXcase #iPhoneXSMAXcase #iPhoneXScase #iPhone12 #iPhone12Pro #iPhone12Mini #iPhone12P",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "[Very Fast Delivery] Live Support Anchor Fill Light Beautify Soft Skin Soft Light Light Box Indoor Lighting Photo Lighting Photography Shooting Mobile Phone Floor Shooting Video Camera Face",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4056321176&shopid=290121531",
        "org_price": "81.31-138.36",
        "new_price": "39.03-66.41",
        "desc": "❤️Maybe our price is not the lowest, but the quality of our products will not let you down ❤️\n①Welcome to our factory outlet store！Hope you have happy shopping！Please Follow Us to get extra followers Discount \n②Your 5 stars is the best support to our store!（Any problem pls contact us 1st, pls dont give bad rating）\n③We are a high quality store, We will always provide the best quality and service ! Please feel free to buy!\n\n【Instructions for return】\n🔸Please check again before the next single purchase of size, color, style, size and so on confirmation and then carry out orders to avoid trouble on your subsequent replacement\n🔸Expected to arrive in about 6 days at the soonest.\n🔸As long as the product has defects / wrong delivery / other problems, please inform us at the first time, we will arrange for you to deal with it as soon as possible.\nFrom now on, regardless of the amount\nJust press ☛ \"Follow\" and ☛ any product and press \"❤️\" (Remarks at the order place)\nSend a mysterious little gift with the package (✿◖◡◗)\n✌Thank you for your support✌\n\nColor Classification: \n1.5m light stand + small light box (without bulb)\n2m light stand + small light box (without bulb)\n[Single lamp] 45WLED white light+large light box+2m light stand\n[Single lamp] LED95W three-tone light + large light box + 2m light stand\n[Single lamp] 135W white light energy-saving lamp + large light box + 2 meter lamp stand\n[Single lamp] 135W warm light energy-saving lamp + large light box + 2m lamp holder\n[Single lamp] 155WLED white light+large light box+2m light stand\n[Single lamp] 105 watts LED silver light + large light box + 2 m light stand\n[Single lamp] 105W remote control bulb+large light box+2m light stand\n[Single lamp] 85W LED white light+Large light box+2m light stand\n[Single lamp] 85W LED warm light+large light box+2m light stand\n[Single lamp] 200W LED white light+Large light box+2m light stand\n\nLighting: white light, warm light, soft light\nNew diffuser, soft light without exposure\nThe lamp holder occupies a small area, saving space/stable base\nLED professional photography light, 5500K standard color temperature, aluminum heat dissipation, constant current drive, low light decay (fluorescent energy-saving lamps are used in some specifications)\nThe angle of 180° can be adjusted freely, and the lamp holder is equipped with an adjustment knob, which can be flexibly adjusted according to the shooting needs\nHigh-reflective particle design on the inner wall, the reflected light is softer and uniform, and the whitening and rejuvenating effect is better\nIntegrated soft box, one-button lock, creative design, easy installation.\n\n💕If the goods and services satisfy you, please give us five stars + pictures and text evaluation encouragement. Next time repurchase, give us screenshot evaluation, and give preferential discount p",
        "brand": null,
        "discount": "52%"
    },
    {
        "name": "KUULAA Car Phone Holder Magnetic Air Vent Magnet Mobile Phone Car Holder For Cell Phone Car Mount Holder Univ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7519568059&shopid=235560782",
        "org_price": "6.03-6.03",
        "new_price": "2.99-2.99",
        "desc": "Brand Name: kuulaa\nCompatible Brand: Universal\nMagnetic: Yesl\nUse: Car\nFeature: 360 Degree Rotation\nMaterial: Rubber Aluminum Alloy\n\nProduct Name: Magnetic Mobile Phone Holder Stand\nType: Magnetic Phone Holder,Magnetic Holder,Car Phone Holder Magnetic\nFunction 1: Phone Magnetic Holder,Magnet Phone Holder,Magnet for Phone in Car\nFunction 2: Phone Holder in the Car, Cellphone Holder,Magnetic Phone Holder\nFunction 3: Magnet Holder, Mobile Car Magnet, Car Magnet for Phone, Magnetic Car\nFunction 4: 360 Degree Rotation, Universal Magnetic car holder\nCompatibility 1: Magnetic Car Holder for iPhone 11 Pro X XS 8 7 6\nCompatibility 2: Air Vent Holder for Huawei Mate 20 P20\nCompatibility 3: Car Phone Holder for Xiaomi Mi 2,",
        "brand": "K",
        "discount": "50%"
    },
    {
        "name": "Samsung S10 S20Fe S20Ultra S9Plus Note 10 Pro S8 S8Plus Silicone Soft Case for Samsung Note 20 Mobile Phone Case CrossBody Strap Lanyard Samsung Galaxy S21Ultra S21 Plus S9 S20 Plus Case Note8 Note9 Note10Pro Note 10 Anti-drop protective",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9030966063&shopid=394851140",
        "org_price": "7.9-7.9",
        "new_price": "7.5-7.5",
        "desc": "Description:\n✔️Soft Phone Case\n✔️Material: TPU\n✔️Easy to put on and easy to take off.\n✔️Protects phone from dust, scratches and shock.\n✔️Durable and fashion.\n✔️Package includes : Casing x 1 unit \n\nModels Available:\n✅Samsung✅\nS8,S8PLUS,S9,S9PLUS,S10,S10PLUS,S20,S20PLUS,S20U,NOTE8,NOTE9,NOTE10,NOTE10 PLUS,NOTE20,NOTE20 U\n\nStore Introduction 💖💖💖 \nLongee Electronics dedicated in offering high quality and reasonable price phone accessories to all my dear customers,We not only pursue the fashion style, but also pay more attention to the quality of materials, all of our material compliance with environmental protection .\n\nQuality Control💪💪💪\nwe stick to the quality, no quality no customers.in order to Set up a good product image we upgrade the five-layer painting process, and carefully shape each mobile phone shell into a fresh handicraft.\n\nCustomers' Concerns 📣📣📣\nAs cases with the same style include many different brand models, it is not possible to take photos of each model separately,there will be differences between the space provided and the buttons! Other materials, patterns and styles are the same as the picture\n\nDelivery Time 🕟🕟🕟\nThis store from mainland China, We try to ship all goods within 2 days after receiving the order.\n Before shipping, our staff will use hard carton packaging and carefully check the quality of the goods.\n\nAfter sales service💚💚💚\nPlease check carefully when receiving the goods, if there is any quality problem, please contact us! If you are satisfied with this product, please give us 5 stars\n\nWarming Tips💥💥💥\nOur store has a stable supply and a variety of styles! There are new styles every week, please pay attention to the store and you can view new arrivals at first time.\n\n#SamsungCase #samsungS10case #samsungS9case #samsungS8case #Note10Procase #Samsungs105gcase #samsungs10litecase #samsungs10pluscase #samsungs9pluscase #samsungs8pluscase #samsungnote9case #samsungmagneticcase #samsungA50case #samsungA70case #samsungm10case #samsungm20case #samsunggalaxymagneticcase #samsungmagneti",
        "brand": null,
        "discount": "5%"
    },
    {
        "name": "Mobile Phone Grip Mobile Phone Ring Fashion Finger Holder Bracket Mobile Phone Back Stick Bracket Lazy H",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7178058210&shopid=131089322",
        "org_price": "3.62-3.62",
        "new_price": "2.17-2.17",
        "desc": "Application Scenarios：Other\nMaterial：Other\n\nDelivery on Time：After Placing Orders24Hours48Hours\n Arrival Time：Following Delivery of the Goods5To12Working Days（Except for Some Special Holidays）\n\nAttention：\nYou Can Use Some Coupons When Placing an Order.。\n Due to Different Display Settings and Light，Its Color May Be Different from the Actual Item。\n If You Have Any Questions，Please Contact Us，We Will Provide You with Services.。\nThank You for Your Support and Understanding。\n\nCheaper and Better Mobile Phone Accessories，Please Click#phonecase\n\n If You Are Satisfied with Our Products，Please5Star Feedback，This Is Very Important to Us.。\n （✿◕‿◕✿）\n....................................................... ...................................................\nThe Product Will Be Tested for Quality before Being Shipped out of the Warehouse.\n“ Nanako”Committed to Providing Customers with Exquisite Products and Quality Services。\nIf You Encounter Quality Problems after Receiving the Product，You Can Contact Us First.。\nIf You Have Not Contacted Us Yet，Please Rate Us Directly。\nWe Think You Are Not an Honest Buyer.，Therefore, We Gave up the after-Sales Opportunity.。\nWe Will Not Deal with Any after-Sales Probl",
        "brand": null,
        "discount": "40%"
    },
    {
        "name": "iPhone series mobile phone case, Colorful sliding lens window iPhone case, iPhone 12/12 pro/12 pro max/11/11 pro/11 pro max casing, anti-drop mobile phone",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9480933225&shopid=426460887",
        "org_price": "18.16-18.16",
        "new_price": "6.91-6.91",
        "desc": "Tip: If you want to buy other iPhone models, you can contact us or add a note and place an order for one of the products. It is recommended that you send us a message first and we will reply you as soon as possible.\n\nApplicable brands: iPhone/Apple\n\nApplicable model: iPhone 8 Plus,iPhone X,iPhone 8,iPhone 7 Plus,iPhone XR,iPhone XS Max,iPhone XS,iPhone 11,iPhone 11 Pro Max,iPhone 12,iPhone 12 Pro,iPhone 12 Pro Max\n\nCase texture: Soft glue\n\nstyle: All inclusive\n\nPopular elements: customized,transparent\n\nstyle: like a breath of fres",
        "brand": null,
        "discount": "62%"
    },
    {
        "name": "Lift Folding Desktop Phone Holder Telescopic Stand Mobile Phone ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7063287281&shopid=153776973",
        "org_price": "-1e-05--1e-05",
        "new_price": "2.56-2.56",
        "desc": "► Folding telescopic bracket\nMaterial: pc+silicone\nStorage specification: 49x wide 7.2 x thick 1.15 cm\nStretch length: total height 11cm-14.2cm\n\n✔ Double axis lifter folding with heart adjustment\n✔ Small delicate portable portable portable mobile phone tablet universal\n✔ Strengthening anti-slip base is stable as mount taishan does not shake\n✔ Upgraded version desktop stand folding storage free lifter\n✔ New posture more comfortable ergonomic design golden ratio placement perspective\n✔ Delicate and tidy anti-slip silicone panel silicone protection rub resistance flower fuselage\n✔ Side play reserved charging port charging chase drama\n✔ Mobile phone tablet universal comfortable chase theater ",
        "brand": null,
        "discount": null
    },
    {
        "name": "Mooyu Sonce New Ultra-Thin Metal Mobile Phone Folding Stand /Zinc Alloy Lazy Phone Holder With Ring/Tablet General Lazy Small Support/Creative Invisible Mini Ring Buckle Desktop Portable Live Stre",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8060366132&shopid=451320468",
        "org_price": "-1e-05--1e-05",
        "new_price": "9.9-9.9",
        "desc": "\nIt's a little expensive, But really good use！！！\n\nThin metal mobile phone bracket with ring, 0.3cm thin, with the same technology and texture as iPad/iPhone, smooth bare-phone feel, more comfortable to hold.\n\nDamped shaft design, not only stable, and durable, beautiful and durable.\n\nNo matter horizontal or vertical, 360°N Angle can be adjusted to meet different needs flexibly.\n\nLet go of your hands, do not bow too much, relax the cervical spine, so that every detail of life is more scientific and more comfortable.\n\n\n\n\n\n\nProduction enterprises:\n\nProduct name: Metal mobile phone holder with ultra-thin ring\n\nMaterial: Zinc alloy\n\nProduct certification: appearance patent/new utility patent\n\nProduct size: 71*41*3.5mm\n\nProduct color: Black, Silver,Rose Gold\n\nScope of application: All models of mobile phones and iPads\n\n\n\nPackage included:\n1 x Folding mobile phone holder\n\n\nAbout after sales service\n--- Top service, top quality product.\n--- If there is a quality problem with the product received, please contact us in time.\n\nIf you like our store ,please follow our store to get more discount in the future!!\nTo be our follower,get surprise now!!!\n\n\n#Mobile phone stents#mobile phone support #mobile phone holder #cellphone mount #Folding bracket#portable#stealth#invisibility#portable#portability#handiness#portable#expen",
        "brand": null,
        "discount": null
    },
    {
        "name": "MTY transparent frame ultra-thin iPhone series mobile phone case. iPhone12/11/11Pro/XSmax drop-proof solid color phone",
        "link": "https://shopee.sg/api/v2/item/get?itemid=10823443049&shopid=421739576",
        "org_price": "13.8-13.8",
        "new_price": "6.9-6.9",
        "desc": "Brand: MTY\n\nApplicable brands: Apple\n\nApplicable models:   iPhone XS Max, iPhone 11, iPhone 11 Pro, iPhone 11 Pro Max,  iPhone 12 , iPhone 12 Pro, iPhone 12 Pro Max, iPhone 12 Max, iPhone 12 mini\n\nProtective cover texture: silicone\n\nStyle: all-inclusive\n\nPopular elements: relief, transparent\n\nStyle: simple\n___________________________________________________\nwelcome to our shop\n\nThings to know before buying:\n\nAll products in the store are directly sold by the factory, with favorable prices and complete varieties. We will continue to add the latest products. Each product must undergo strict inspection and disinfection before leaving the factory.\n\nEach product has a quality inspection report, please rest assured to buy!\n\nWe will take off from China. The delivery time to Singapore is usually 5-8 days. From Zhangzhou, Fujian, China\n\n💖Welcome to negotiate with exporters, traders, distributors, bulk buyers and corporate buyers💖\n\nAll products can be customized packaging\n\nThe unit of quotation is Singapore dollar.\n\nthank you very",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "New desktop phone holder, mobile phone holder, adjustable universal desktop phone h",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4251662508&shopid=196567990",
        "org_price": "8.5-38.0",
        "new_price": "2.77-7.77",
        "desc": "Welcome for your arrival! heimi26.sg✍\nQuality is the first with  24-hour all-day customer service✍\n100% Brand New, Authentic quality!✍\nIf the product has any quality problems, the store unconditional full refund✍\n\n★🍁★🍁★🍁★🍁★🍁\nFor All Phone Mobile Phone\nFor All Phone Mobile Phone\nFor All Phone Mobile Phone\n★🍁★🍁★🍁★🍁★🍁\n\nT1 Universal Desktop Tablet Phone Holder Folding Metal Cell Mobile Phone Stand Desk Table Support Mount for iPhone iPad\nSpecification:\nModel: T1\nApplication: mobile phone, tablet\nMaterial: Metal + Silicone + ABS\nColor: Black, White\nBody net weight: 202g\nGross weight : 245g\nProduct size: 110x66x156mm/4.33x2.60x6.14\" (approximate)\nPacking size: 85x135x35mm/3.35x5.31x1.38\" (approximate)\nProduct Description:\n\nUniversal for： All phones and tablets\n\nCompatible Brand:Universal, Such as:\n★🍁For iPhone 4S / 5 / 5G / 5C / 5S / 6 6S Plus / 7 7S Plus holder\n★🍁For Samsung /For Motorola /For HTC /For LG /For Nokia, etc\n★🍁For Samsung S5 S6 S7 S8 Plus holder\n★🍁For Xiaomi 5 5s Plus 6 For Redmi Note 2 Note3 Note4 holder\n★🍁For Huawei P9 P9Plus P10 P10Plus holder\n★🍁For All Phone Mobile Phone\n \n★🍁Product p",
        "brand": null,
        "discount": "80%"
    },
    {
        "name": "8X12X Zoom Lens Telephoto Lens Zoom Effect High-Definition Lens Focus Monocular Phone Telescope For A Mobile Phone Phone Len",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8982498686&shopid=490168126",
        "org_price": "39.99-42.99",
        "new_price": "19.6-21.07",
        "desc": "Characteristics:\n\nLightweight shell for clear display.\n\nEasy to use, compact and portable.\n\nOptical glass, practical and durable.\n\nWith high zoom, adjustable focal length.\n\nNew optical path design, large wide angle, large amount of light transmission.\n\nDescription:\n\n\nWith high resolution and good color rendering, the quality of mobile phone imaging is significantly improved.\n\nSuitable for watching competitions, concerts, tours, animal watch enthusiasts.\n\nExquisite workmanship, feel sand, comfortable to use.\n\nSpecification:\n\nMaterial: ABS\n\nColor: black, white\n\nSize: 90*30*30mm\n\nMagnification: 8x, 12x\n\nField of view: 16 °\n\nObjective diameter: 18mm\n\nEyepiece diameter: 16mm\n\nObservation distance: 3-246m (8x), 3-1000m(12x)\n\nExit pupil distance: 3mm (8x), 2.3mm(12x)\n\nEyespot distance: 9.6mm (8x), 10mm(12x)\n\nPackage included:\n\n1 x Mobile Phone Telescope\n\n1 x Lens Cover\n\n1 x Lens Front Cover\n\n1 x Mounting Clamp\n\n1 x Clean C",
        "brand": null,
        "discount": "51%"
    },
    {
        "name": "Upgraded metal phone holder, tablet holder, adjustable Ipad HP holder, mobile phone desktop holder, lazy ipad tablet, universal folding lift, multi-function telescopic金属手机支架平板支架可调节支架手机桌面支架懒人ipad平板电脑通用折叠式升降",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8087638014&shopid=447661128",
        "org_price": "5.6-14.78",
        "new_price": "2.8-7.39",
        "desc": "Welcome to Kungfu Store, we will use our warm service and 99 points of sincerity to do one thing well, that is, let every product of Kungfu Store enter every family~because we are the sun! Thank you for your support, the next step is the product introduction~\n⭐New product: The ultimate upgraded version of aluminum alloy mobile phone holder, new design, better material, better hand feeling! ! !\n This phone holder supports tablets and phones! It is equivalent to buying one to achieve the effect of two!\nDescription: 100% brand new and high quality. Metal frame, durable. A universal stand suitable for almost all smartphones and tablets. It is great for watching videos, reading and learning, playing games, making video calls and video conferences, using Facetime, and watching YouTube. It is a great desktop accessory for your office and home. The angle can be easily adjusted by hand (0°~120°), and it is firmly fixed, which helps to fix the posture and reduce the pressure on the neck and back. Developing good machine habits is good for bones. development of.\nMaterial: aluminum alloy\nColor: Alloy Edition [Yoshi Black] Alloy Edition [Ivory White] Plastic Edition [Yoshi Black] Plastic Edition [Ivory White]\nAngle adjustment: 90 degrees\nNote: 1. Due to the difference of light and screen, the color of the product may be slightly different from the picture.\n2. Due to manual measurement, please allow a difference of 0.5-2 cm.\nOur shop promises that in order to give all consumers a guarantee, we can provide one-year free warranty ser",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "iPhone 12 Pro Max Casing Mobile Phone Case XS MAX Protective Shell Iphone8 Plus With Diagonal strap lanyard Apple XR Silicone Soft Shell IPhone X XSMAX 7plus 8plus SE2 11 11Pro 11ProMax 12 Pro Max Cover Accessories With Card pocket Coin Purse Leather",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7646086521&shopid=279931644",
        "org_price": "-1e-05--1e-05",
        "new_price": "11.9-11.9",
        "desc": "Product Name: pocket phone case\n\nApplicable model: Apple seriesi6 i6s i6plus i6splus i7 i8 i7plus i8plus X XS XR XSMAX    iphone11 iphone11pro  iphone11pro max\n\nMaterial: silicone\n\nBasic features: silicone soft edge full edge protection! The back can punch in the change, the card, with diagonal straddle sling\n\nStore problem: this store will ship goods in mainland China and place an order5-8Working days to come, affordable stores, affordable prices! The whole store is full988Free shipping!\n\nWarm tips: if you receive defects and other quality problems, please inform us immediately, we will try our best to deal with them for you! We apologize for the trouble caused to you. Please do not use evaluation as a way of communication. Thank",
        "brand": null,
        "discount": null
    },
    {
        "name": "Cute Astronaut Creative Mobile Phone Stand Holder iPad Stand Holder For Popular Phone and pad  gift for girlfriend boyfrien",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5396391211&shopid=439916422",
        "org_price": "19.9-19.9",
        "new_price": "9.9-9.9",
        "desc": "🚩If you've just needed a tool that helps you angle your phones as you watch YouTube videos\n🙆‍♂️This stand helps hold your phone for your more convenient behavior. \n🎁These phone holder can be a perfect gift for your family and girlfriend boyfriend. \n\n\n🚚Shipping & Logistic:All orders will be shipped within 48 hours  from China\n🚚You may get it 5-10 days latter by Shopee Logistic Shipping.\n🚚It is easy to break, please check before signing\n🚚If it is broken please chat us at frist with photos.\n\nPackage:\n1* Mobile phone holder\n\n#phone holder #phone stand #desk phone holder #mini phone holder #holder #tablet holder #mobile phone holder  #table stand#Cute phoneh",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "Shangpin Digital #Spot goods    Mobile phone holder can lift and shoot video multifunctional telescopic desktop live broadcast lazy mobile phone holder tablet photo artifact   #xiaomi#samsung#holder#portable#griptok#flower h",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6496599066&shopid=447794324",
        "org_price": "-1e-05--1e-05",
        "new_price": "24.0-32.0",
        "desc": "\n* Welcome to our store\n* Pay attention to the store and get coupons\n* After receiving the voucher, the order price is more favorable.\n* There are more full discount offers for you to choose from!\nApplicable scenario: desktop\nMaterial: plastic\n[1] Logistics Information: Water and Water Orders Will Be Delivered in the First Time\nIt will take about 6-10 days to receive it. No urgent orders will be received.\n[2] Praise and Gift: After ordering our products, upload the real use experience,\nFive-star praise can contact me to receive coupons.\n[3] After-sales problems: Please contact me as soon as you have any problems after receiving the goods, and you will deal with them in ",
        "brand": null,
        "discount": null
    },
    {
        "name": "Apple 11 mobile phone shell iPhone12 wristband 8plus all-inclusive anti-drop 6P/8/xs/xr/12pro bracket ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9180925477&shopid=458007262",
        "org_price": "7.98-7.98",
        "new_price": "3.68-3.68",
        "desc": "💕Welcome to our shop.💕\nCase iPhone SE 2020 11 Pro Max X Xs Xr 6 6s 7 8 Plus\nCute cartoon Hello Kitty soft TPU phone case with anti-fall back cover\n\n\nFeatures: anti-dirt, anti-explosion, anti-drop\nFeatures: cute, cartoon hello kitty\nType: Soft TPU shell\nCompatible models: iPhone SE 2020 /iPhone 11 pro max /iPhone 11 pro /iPhone 11 /\niPhone xs max /iPhone xs /x /iPhone 7 /iPhone 8/iPhone 7 plus /iPhone 8 plus /\niPhone 6 plus /iPhone 6\n\nnotes:\nAll products are in stock, and we will ship all orders within 2 days.\nAll our products are in stock.\nAll our products are shipped from China, 7-15 days shipping\nIf you have any questions, please contact our customer service, we will reply in time!\nOrder one and have a nice",
        "brand": null,
        "discount": "54%"
    },
    {
        "name": "【Brother Mobile】 Apple iphone 6  16GB 64GB100% Original Global Rom International Sof",
        "link": "https://shopee.sg/api/v2/item/get?itemid=7396882731&shopid=473585928",
        "org_price": "152.64-173.64",
        "new_price": "83.96-98.98",
        "desc": "Ladies and gentlemen\nPlease read it carefully before buying.\n\n* IOS\nIPhone 6 ios 12.4 LTE 4G \n(We have upgraded to the latest system)\n(Unlocked version, SIM card can be used)\n\n* Purchase the following accessories for free now\nAccessories (W/O box)\n1x iPhone < br/Haizi\n1x plug charger < br/haizi >\n1X Usb cable < BR/child\n1X Headset <br/haizi>\n\n* for new\n90% of new for the one has fingerprint , 80% for the one without fingerprint\nWe only sell the original second-hand cell phones\nIt has SIM card slot/open line\nIt looks new and works well\n(Unrefurbished/cloned)\n(warranty)\n\n* The warranty is void when the sticker is removed *\n- 30 days warranty after receipt of goods\n- iPhone ID has no warranty\n- Dropset without warranty\n- Water damage is not guaranteed\n- Warranty stickers are invalid without warranty\n- The modified software is not guaranteed\n\n* (refund)\nWe accept 100% refund for any reason\nWithin 7 days after arrival\n(Return freight to be borne by the buyer)\n\n*(Delivery details)\nPlease make sure your address and telephone number are correct.\nGenerally, the goods will be delivered within 2-3 working days after receiving the payment.\n\n*(Contact us)\nIf you have any questions, please feel free to contact us and we will reply to you within 1 workin",
        "brand": "Apple",
        "discount": "45%"
    },
    {
        "name": "Shangpin Digita #Spot goods  Desktop universal bracket folding portable four-block shell adjustment watch mobile phone lazy bracket#xiaomi#samsung#holder#portable#griptok#flower h",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8986116239&shopid=447794324",
        "org_price": "20.0-23.0",
        "new_price": "19.0-21.85",
        "desc": "Material: plastic * welcome to our shop\n* Pay attention to the store and get coupons\n* After receiving the voucher, the order price is more favorable.\n* There are more full discount offers for you to choose from!\nMaterial: plastic\n[1] Logistics Information: Water and Water Orders Will Be Delivered in the First Time\nIt will take about 6-10 days to receive it. No urgent orders will be received.\n[2] Praise and Gift: After ordering our products, upload the real use experience,\nFive-star praise can contact me to receive coupons.\n[3] After-sales problems: Please contact me as soon as you have any problems after receiving the goods, and you will deal with them in ",
        "brand": null,
        "discount": "5%"
    },
    {
        "name": "iPhone series mobile phone case, cartoon jingle cat, iPhone 12/12 pro/12 pro max/11/11 pro/11 pro max casing, anti-drop mobile phone",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4595132180&shopid=426460887",
        "org_price": "19.62-19.62",
        "new_price": "7.46-7.46",
        "desc": "Applicable brands: iPhone/Apple\n\nApplicable model: iPhone 11 Pro Max,iPhone 11,iPhone 11 Pro,iPhone 12 mini,iPhone XS,iPhone XS Max,iPhone XR,iPhone 12 Pro Max,iPhone 12,iPhone 12 Pro,iPhone X,iPhone 8 Plus,iPhone 8,iPhone 7 Plus,iPhone 7\n\nCase texture: Soft glue\n\nstyle: All inclusive\n\nPopular elements: customized\n\nstyle: Ca",
        "brand": null,
        "discount": "62%"
    },
    {
        "name": "Bunny Bear Style Phone Holder Tablet Stand With Makeup Mirror function Desktop Mobile Phone Lazy Bracket Tablet Adjus",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8473368031&shopid=426425272",
        "org_price": "25.79-25.79",
        "new_price": "15.99-15.99",
        "desc": "Specifications:\n\n\nColor: Blue/White/Pink\n\nSize: Suit for Phones and Tablets within 12.9 inches\n\nFunction: Phone heightening bracket\n\nMaterial: Plastic\n\nFeatures:\n\n1> Portable and foldable\n\n\n2> Angel adjustment\n\n\n3> Non-slip silicone bottom\n\n\nPackage:\n\n1* Phone ",
        "brand": null,
        "discount": "38%"
    },
    {
        "name": "Adjustable Phone Stand Aluminum Alloy Mobile Phone Holder Tablet Iphone Stand Compatible with All Mobile Phone",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9683488123&shopid=478222507",
        "org_price": "23.99-23.99",
        "new_price": "16.32-16.32",
        "desc": "🎩Features:\n\n✅【Wider Compatibility】:LeiGei table Phone stand fits all smartphone, tablets and e-readers (4- 11''), including For Phone 12 Mini, 12, 12 Pro, 12 Pro Max, 11, 11 Pro, 11 Pro Max, SE, XS, XS Max, XR, X, 8 Plus, 8, 7 Plus, 7, 6s Plus, 6s, 6 Plus, S20+, S20, S20 Ultra, S10, S9, S8, iPad Mini, 9.7'' iPad / Pro / Air etc.\n✅【Simple&Easy to carry 】:Compact size, this portable cell phone tablet stand is easy to fold, you can collect and storage easily to take anywhere , a perfect companion for travel, home ,business trip and office,also an good ideal choice for presents.Smooth edge, simple, lightweight, perfectly works with your smartphones.\n✅【FOLDABLE & PORTABLE】Adjustable Height and Perfect Angle: Appropriate height and perfect viewing angle give you the best experience when you use Face time and watch the video. Perfect for watching videos, viewing pictures, and playing games in your home. Foldable design makes it possible to be shrunk to pocket-size and portable to carry even when you go traveling.\n✅【Make Your Life Easier】Using this desktop phone holder at home to prop up your phone, you can better view recipes while cooking. It's also great for on your nightstand, so no more fumbling around in the morning to shut off the alarm.\n✅【Practical design&Desktop Partner】:A humanized charging port is reserved, the phone stand holder allows you play your device while charging, and the depth of groove fits exactly with the phone and does not block the screen,You can freely use it to watch movies or chat with family and friends.Great desk accessories for office and home. A smartphone stand with perfect viewing angle for making phone calls, watching movies, viewing recipes, online learning, working meetingsand Face time.\n                                               WELCOME TO Luckcomee Shop \n\n😘I am very happy to serve you. \n🎫If you want to buy our products.Don't forget to follow our store first, and you can receive a coupon. save money!\n🚛All our products are shipped from Shanghai, the delivery process takes about 4-8 days\n⚡ We will send it within two days after your payment\n✨We will check carefully before shipment\n\n🚧After-sales service\n💪We promise to help customers solve problems regardless of cost\n🎈If there is a problem with your product, we will directly replace you with a brand new product\n👩As a seller, I want to say that many times I am also a consumer myself. \n    If I buy bad products, I will be upset. Therefore, our products are strictly selected by us, and we will bring you the most cost-effective and most useful products. And delivered to you s",
        "brand": null,
        "discount": "32%"
    },
    {
        "name": "iPhone X luminous mobile phone case iphone XR, iphone7 plus, iphone8, iphone8 plus mobile phone case smart voice control call flashing tide brand mobile phone",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8351814354&shopid=426460887",
        "org_price": "44.52-44.52",
        "new_price": "17.81-17.81",
        "desc": "Welcome to luciferarmy store.\n\nPlease read the following before purchasing this product\n\nApplicable brand: iPhone\n\nProtective cover texture: tempered glass\n\nPopular element: Luminous\n\nStyle: simple\n\nIntroduction to the principle of luminescence:\n\n1. The connector of the phone case is inserted into the phone for the first time, and it stays on for 3-5 minutes.\n\n2. The phone case will automatically glow when the screen is on, incoming calls, app push, etc.\n\n3. After turning off the phone screen, there will be a slight delay, and the phone case will turn off the light. If there is an APP running in the background, the light will be turned off after a delay, occasionally triggering a long light.\n\n4. Normally turning on the Bluetooth of the mobile phone may cause the mobile phone case to be bright, super energy-saving LED light source, and extremely low power consumption, which does not affect the battery ",
        "brand": null,
        "discount": "60%"
    },
    {
        "name": "Desktop Adjustable Cell Phone Stand, Fully Foldable Aluminum Mobile Phone Stand Holder Cradle Dock with Anti-Slip Base and Charging Port, Compatible for All Smart",
        "link": "https://shopee.sg/api/v2/item/get?itemid=10721703968&shopid=478222507",
        "org_price": "25.25-35.99",
        "new_price": "17.17-24.48",
        "desc": "🎩Features:\n\n[ ELEGANTl ALUMINUM MATERIAL ] The beautiful appearance phone stand is Exquisite Workmanship, made of aluminum alloy, Similar CNC technology as Macbook adopts, smooth edge, sturdy, lightweight, portable, you will enjoy the comfortable sense of touch.\n[ MULTI-ANGLE & ERGONOMIC DESIGN ] The mobile phone holder with dual axis can be easily change angle by hand, stays firmly on your desk. The aluminum arm is ergonomically designed and can be fixed at height of 4.9inch, provides comfortable viewing angle, helps to fix your posture, reduce neck & back strain. You can easily folded it into a palm size and put in a bag when you travel or have a meeting. Note: the height of the phone stand is not adjustable.\n[ SUPER STURDY & ANTI-SKIDDING ] Aluminum surface treatment can provide excellent quality and strong stability can withstand a weight of 2lbs, casted with solid aluminum alloy at the bottom, equipped with a fully covered non-slip silicone pad, stable and strong. This holder can protects your device from any scratches. Balance of gravity design and sturdy structure of the mobile stand supports screen touching stable when enjoy your viewing experience.\n[ WIDE COMPATIBLE ] This dual shafts stand compatible with all 3.5-13 inch smart phone and E-reader, will fit tablet/phone with most cases or sleeves, such as iPhone 11 Pro Max, XS Max ,XR ,X ,8 Plus, Samsung Galaxy S10 S9 S8 S7 S6, Note 9 8 6 5, LG, Sony, Nexus, Nintendo Switch, iPad mini / pro / Air, Samsung Tab, Google Nexus, Kindle, although with cases. It is a good desk accessories while watching video, reading, playing games, video recording, FaceTime call and more hands-free operation.\n[ NICE LOOK & HANDS-FREE ] This adjustable phone holder is so stylish, supports hands-free. Cable management design, It provide convenice to charge your device while setting it up. Using it at home/office to prop up your phone/iPad/tablet easier for viewing recipes, faceTime, Tiktok, zoom meeting, video recording, online conferences, watching movie, reading, playing games. It is a great desk accessories for your office and home.\n\n                                               WELCOME TO Luckcomee Shop\n \n😘I am very happy to serve you. \n🎫If you want to buy our products.Don't forget to follow our store first, and you can receive a coupon. save money!\n🚛All our products are shipped from Shanghai, the delivery process takes about 4-8 days\n⚡ We will send it within two days after your payment\n✨We will check carefully before shipment\n\n🚧After-sales service\n\n💪We promise to help cu\nstomers solve problems regardless of cost\n🎈If there is a problem with your product, we will directly replace you with a brand new product\n👩As a seller, I want to say that many times I am also a consumer myself. \n    If I buy bad products, I will be upset. Therefore, our products are strictly selected by us, and we will bring you the most cost-effective and most useful products. And delivered to you s",
        "brand": null,
        "discount": "32%"
    },
    {
        "name": "Ankndo 360º Car Phone Holder Handphone Stand Dashboard Air Vent Mobile Phone ",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6777497564&shopid=340306593",
        "org_price": "3.06-18.29",
        "new_price": "1.38-5.66",
        "desc": "✅【All goods are in stock】\n💁【We ship within 24 hours of your order】\n🚚【You can receive the package within 5 to 10 days】\n\nNote:\n1. Applicable mobile phone width: 4.8-10cm.（3-7 inch）\n2. Multi-purpose holder and Rotat holder Applicable models: GPS navigation, iPhone series, Samsung, Huawei, Xiaomi, Meizu and other brands.\n3. Multi-purpose holder and Rotat holder Not compatible with:Toyota corolla,Highlander,Rav4 & Honda CRV\n\nMulti-purpose holder Features:\n1. Made of brand new ABS material, environmentally friendly and durable.\n2. Suitable for most mobile navigation models.\n3. It can be rotated 360°, and various visual angles can be adjusted freely.simple operation, practical effect.\n4. Four - claw card position, the phone is more stable and not easy to drop\n5. The buckle structure is adopted, which is convenient for quick disassembly and installation.\n6. With foam (or soft glue) on the contact part of the mobile phone, it can effectively protect the mobile phone from being scratched.\n7. It can be fixed to car rearview mirror/instrument panel/sun visor/multi-purpose. \n8. Can be placed with any place, a wider range of applications\n\nRotat holder-1 Assembly Method:\n1.Remove stand base + chuck\n2.Unscrew the nut on the chuck\n3.Put the nut into the base ball\n4.Install the base universal ball into the chuck5.Press the universal ball hard\n6.Screw on the nut and complete the assembly\n\nProduct details:\nMaterial: ABS plastic\nColor: Black\nMulti-purpose holder Size: 57.5X41X47.5cm\nMulti-purpose holder Net weight: 111g\n\nPackage Included:\n1 x Car Phone H",
        "brand": null,
        "discount": "69%"
    },
    {
        "name": "COD Case OPPO A74 A94 A53 2020 A5S A7 A12 A11K A15S A15 Realme C21 C20 8 pro C25 C11 C12 C15 Narzo 20 30A Y31 2021 Y20i casing phone mobile casing cases cover mobile case Silicone shockproof High-quality new silicone shock",
        "link": "https://shopee.sg/api/v2/item/get?itemid=3060231592&shopid=462120521",
        "org_price": "3.83-3.83",
        "new_price": "1.92-1.92",
        "desc": "◇◇Product Description\r\n\r\n1.Perfectly fitted for you phone model\r\n\r\n3.Green environmental protection, fashion cartoon Design\r\n\r\n4.According to real mobile phone opening mold,Perfect access design for speaker, buttons, camera and ports, etc.Let your mobile phone operation is convenient.\r\n\r\n5.Protection from scratch, dust and impacts.\r\n\r\n6.Best quality, Lowest price.\r\n\r\nAAA advantage>>\r\n\r\nQ:Drop Shipping support , provide pictures to resellers?\r\n\r\nA; Yes.\r\n\r\nQ:Do After-sell service,if have any problem about the product ?\r\n\r\nA:Yes.\r\n\r\nQ: How long is the Shipping days?\r\n\r\nA: 14 to 18 days will arrived your hand from the day you order\r\n\r\nQ:When the Order is incompleted,How to solve?\r\n\r\n\r\nA: 1.When you Meet this Problem ,Please Don't Finished The Order ,You should better contact us at first time.After We Check,If\r\n\r\nOur Seller Fault,You can send Refund Requst to us ,We will agree .Then the missing or damaged case money will return to your shopee pay automatically.\r\n\r\n2.If the order is finished before you found the order was incompleted .You Send Email to Support@shopeemy shop Or Call Shopee Indonesia Service Phone Number.\r\n\r\n\r\nMore Phone Case Model ,Please contact us by chat tools,we will reply your question quickly!!\r\n\r\n\r\nPacking： 1*Phone Case\r\n\r\n#samsungcase #casing #phonecase #case #softcase #phonecover #cover #oppocase #vivocase #iphonecase #redmicase #xiaomicase #phonecasing #realmecase #realme #oppo #vivo #samsung #redmi #x",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "2021 new wired headset in-ear mobile phone universal with Mack high sound quality round hole 3.5mm interface",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9670247983&shopid=473421654",
        "org_price": "-1e-05--1e-05",
        "new_price": "20.93-24.3",
        "desc": "Brand: Other/Other\nModel: fd32\nDiameter of plug: 3.5mm\nHeadset output audio source: communication equipment\nPackage type: official standard\nHeadset category: Android wire-controlled headset Game headset\nWear mode: earplug type\nHeadphone type: wired\nWhether to control by wire: the headset body button control\nCompatible platform: Android Alios iOS Yunos\nType of intelligence: other intelligence\nAvailable time: 2019-05-05\nMusic type: Universal\nSensitivity: 10",
        "brand": null,
        "discount": null
    },
    {
        "name": "UGREEN NEW Car Phone Holder Gravity Auto Stand Car Air Vent Mount Mobile Phone Universal H",
        "link": "https://shopee.sg/api/v2/item/get?itemid=4574306054&shopid=102384739",
        "org_price": "22.92-22.92",
        "new_price": "11.46-11.46",
        "desc": "Brand Name: UGREEN\nType: Car Holder\nModel Number: LP274\nOrigin: CN(Origin)\nFeatures: Gravity Expansion\nCompatible Brand: Universal\nCharger: No\nHas Speake",
        "brand": null,
        "discount": "50%"
    },
    {
        "name": "Mobile phone case, four-corner protection, anti-drop, transparent, ultra-thin, suitable for Oppo Reno5 Reno4 A9",
        "link": "https://shopee.sg/api/v2/item/get?itemid=2984628586&shopid=474913616",
        "org_price": "12.28-12.28",
        "new_price": "6.76-6.76",
        "desc": "【Available】Suitable for Oppo Reno5 Reno4 A93 A53\n \n 【Military Grade Drop Protection】The protective case passed military drop test standards. Even if the phone is dropped from a height of 100 times to a hard surface But it can still survive 100 times. Soft foam rubber lining. combined with polycarbonate hard shell Provides protection, making the shell more durable.\n \n 【360 DEGREE PROTECTION】The edge around the camera protrudes 3mm more and the edge around the screen is 1.5mm higher than the phone, protecting the screen and camera from surface drops and scratches.\n \n 【Fit and Sensitive Buttons】This protective case fits the phone perfectly. Easy to press buttons, get a sensitive response.\n \n 【Anti-Slip Design】The dents on the sides of the phone case provide a certain degree of grip. to hold firmly in the hand\n \n If the phone case doesn't meet your expectations please let me know no matter what the problem Please contact us for the best solution as soon as poss",
        "brand": null,
        "discount": "45%"
    },
    {
        "name": "Phone Stand, Tablet Stand, Portable Foldable Adjustable Universal Desktop Mobile Handphone Holder Cradle",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9016666228&shopid=9837716",
        "org_price": "17.9-26.9",
        "new_price": "6.9-9.9",
        "desc": "UNIVERSAL COMPATIBILITY: This phone stand works with all 4-10\" Smartphones Tablets and e-readers, such as iPhone 12 Pro Xs Xs Max Xr X 11 8 7 6, Switch, iPad mini, Samsung Galaxy S10 /S10+/S9 /S9+/S8 /S8+, Samsung Tab, Google Nexus, Kindle.\n\nADJUSTABLE & PORTABLE: The phone holder is fully collapsible, it can be easily adjusted to an ideal position, free your hands, which is a good desk accessory while watching the video, playing games, making a phone call, viewing recipes, using Facetime.\n\nSTURDY & PROTECTIVE: The cell phone stand is made of high-quality premium aluminium, it stays firmly in place, holds your phone steadily, no worry about any wobble at all. The rubber pads can protect your phone from any scratching and sli",
        "brand": null,
        "discount": "63%"
    },
    {
        "name": "Original Apple iPhone 5 iphone4s Used Cellphone GSM 3G Unlocked Mobile Phone 16GB 32GB 64GB ROM Wifi 8MP 4.0\"   90% As",
        "link": "https://shopee.sg/api/v2/item/get?itemid=6194411223&shopid=488160388",
        "org_price": "45.16-118.96",
        "new_price": "27.1-59.48",
        "desc": "Brand Name : APPLE\nApple Model : iPhone 5 \nBattery Type : Not Detachable\nROM : 16G\nCharging Power : Other\nOrigin : CN(Origin)\nItem Condition : Used    This is used phone, Look conditions 90% like new. \nOperation System : ios\nBiometrics Technology : NO\nFront Camera Quantity : 1\nRear Camera Pixel : 8MP\nBattery Capacity(mAh) : 1440\nTouch Screen : Yes\nFast Charging : Nonsupport\nLanguage : Italian\nDisplay Resolution : 640x1136\nRAM : 1G\nRear Camera Quantity : 1\nCertification : CE\nCharging Interface Type : Other\nFront Camera Pixel : 2MP\nWireless Charging : NO\nDesign : BAR\nSIM Card Quantity : 1 SIM Card\nDisplay Size : 4.0\n3.5mm Headphone Port : YES\nScreen Type : Normal Screen\nStandby Time : Up To 48 Hours\nNFC : NO\nOptical Zoom : 3X\nScreen Material : LCD\nThis is used phone, Look conditions 90% like new. \n all features work well\n(Any sim card / Wordwide can use)\nGood&Original quality \n\n(PACKAGE)\n1x Apple iPhone (100% Original)\n1x Usb Cable\n1x Case\n* Accessories not ori",
        "brand": null,
        "discount": "63%"
    },
    {
        "name": "BASEUS Otaku Life Rotary Adjustment Lazy Holder Mobile Phone Holder For Phone iPhone 11 Pro Max Xs Xr 8 7 6 Samsun",
        "link": "https://shopee.sg/api/v2/item/get?itemid=5144290280&shopid=10208",
        "org_price": "39.9-39.9",
        "new_price": "20.9-20.9",
        "desc": "🌟Take Note🌟\nSelf collection address is at:\n\nCanberra Plaza\n133 Canberra View\n#02-12\nS750133\n\nBASEUS Otaku Life Rotary Adjustment Lazy Holder Mobile Phone Holder For Phone iPhone 11 Pro Max Xs Xr 8 7 6 Samsung S10\n1.otaku life rotary adjustment lazy holder ， enjoy your favorite TV series on the most comfortable bed.\n-2.triple stability enhancement with double-section alloy rod core + flexible hose ， firm clamping of cell phone / pads without falling.\n-3.simple adjustment at ease ， easy hose shaping as you desired.180 ° vertical adjustment ， stepless lock catch design ， free adjustment to your favorite height.\n-4.ball head adjustment for free one-handed operation, rotating freely between portrait and landscape.\n-5.strong and secure locking ， never worry about hitting face ， high-strength extension spring firmly clamps your cell phone / pad.\n-6.mobile and tablet universal ， compatible with 4.7-12.9 inches equipment.\n-7.support clamping onto furniture without damaging the surface ， suitable for 0-30mm thick table b",
        "brand": "B",
        "discount": "48%"
    },
    {
        "name": "KUULAA Universal Phone Desk Holder Tablet Desktop Holder Telescopic Desktop Stand Adjustable Mobile Phone Support For Smartphone Mobil",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8541377868&shopid=235560782",
        "org_price": "13.9-13.9",
        "new_price": "7.9-7.9",
        "desc": "product description:\nSuitable for iPhone, Samsung, iPad, PC, tablet, e-reader, etc.\nProduct Name: Flat Folding Desktop Stand\nMaterial: carbon steel + ABS\nTelescopic height: 125-165mm\nWeight: 171g\nColor: black, white,\n\nfeature:\n-Adjustable angle allows you to adjust and choose the viewing angle you like.\n-The rubber pads on the bottom and base can protect the phone and stand from sliding and scratching.\n-The desk phone holder can provide a safe and reliable mount for your smart phone, or even a small tablet in portrait or landscape mode. Now it’s time to take a break and enjoy watching videos, reading, face-to-face calls or just browsing the web with this phone holder.\n-Foldable design, easy to carry\n\ndescription:\n100% brand new and high quality.\nA universal stand for almost all smartphones and tablets.\nIt is ideal for watching videos, reading and learning, playing games, conducting video calls and video conferences, using Facetime, and watching YouTube.\nThis is a great desk accessory for your office and home.\nIt can be easily adjusted to an angle  by hand, and it is firmly fixed in place, which helps to fix the posture and reduce the pressure on the neck and back.\n\nPackage Included:\n1 *Mobile phone desktop ",
        "brand": "K",
        "discount": "43%"
    },
    {
        "name": "TVboxMall Asher Free Fire H9 Game Controller With New Six Finger Gamepad Handle Joystick Controller for PUBG L1R1 with Cooler Button Mobile Phone Game HandleTrigger for",
        "link": "https://shopee.sg/api/v2/item/get?itemid=8329908008&shopid=401238111",
        "org_price": "10.84-16.14",
        "new_price": "6.51-9.69",
        "desc": "⭐Welcome to TVboxMall !!🎮\n⭐All goods are ready in stock, we will ship as soon as you ordered~\n⭐If you are a wholesaler, please feel free to contact us for wholesale price.\n🚚 All the products in my shop are shipped from China,it needs 8-15 days to you \n🎫Remember to follow us to claim the new buyer voucher!!\n\n⭐Specifications about product\n1. This product is a retractable front key reversible posture game handle, fireproof, no delay, very comfortable to the hand, and ergonomic design.\n2. Suitable for Android, Apple smartphones and various mobile games, such as PUBG games and King Glory.\n3. Support smart phones with 4.7-6.0 inches screen and 10.5mm thickness, impulse, photos and listening to music without shielding. Supporting mobile phones with or without leather cases will not affect the use.\n4. With this product, it is reliable to fix the mobile phone, and it protects your mobile phone well. The upper and lower positions and stress positions of the mobile phone are pasted with EVA and silicone ointment in many places.\n5. The installation method of this product is as follows: first turn the front button, then put any of your mobile phones into the card slot, then stretch the handles on both sides, and then put the whole mobile phone into the handle. At the top, release the handle, enter the mobile menu, make settings, and then turn back to the front button to use.\n6. The handle is equipped with a cooling fan, which can prevent the phone from having a fever and make the game more smooth and lasting.\n\nProduct model: H9\nMaterial: environmentally friendly ABS + zinc alloy\nPacking size: 150mm * 110mm * 50mm / 5.9 * 4.33 * 1.96''\nPackage weight: 130g\n\n☑️Note:\nDue to manual measurement, please allow a distance of 1-3 cm.\nDue to different displays and different lighting, the picture may not show the actual color of the item. Thank you for your understanding.\n\n\n☑️Others:\nWe also with other model earphone in our shop,plz enter and impress all model which you may also l",
        "brand": null,
        "discount": "40%"
    },
    {
        "name": "Creative Mobile Phone Holder Desktop Lazy Bracket Multi-Functional Storage Rack Desktop Storage Rack Mobile Phone Stand for TV Wat",
        "link": "https://shopee.sg/api/v2/item/get?itemid=9385409364&shopid=493510731",
        "org_price": "9.0-13.0",
        "new_price": "2.79-4.03",
        "desc": "【Welcome】\nApplication Scenarios：Desktop\nMaterial：Other\n\nStores Are for the Spot，Wholesale Price The Mainland Sent，Single48Hours out of the Library，Normal7-10Days of Arrival，In Case of Customs Inspection，The Delivery Is Delayed for a Few Days.\n\nBecause It Is an Overseas Seller，Please Be Careful When Ordering Urgent Orders~Please Understand。\nIf There Is Any Problem after Picking up the Goods，Please Contact Us in Time for Handling，I Will Handle It until You Are Satisfied，Don't Give Negative Comments Directly\n※Attention，You Can Get More Discounts \n\nYou Can Place Orders by Yourself，Order First and Ship First\n\n1.All Goods on Sale Currently Available，Please Rest Assured Purchase；\n2.On the Same Day12:00Order，On the Same Day Shipping；\n   On the Same Day12:00Place an Order after，The next Day Delivery，The Order Will Be Placed in7-10Daily Delivery to Pickup Stores；\n3.Follow and Collect Our Store，Enjoy Great Deals，The Store Regularly Updates Welfare Feedback to New and Old Customers；\n⭐4.Each★★★★★Star Praise Is Very Important to Us，I Hope Our Sincere Service Will Win Your Recognition！\n\nThe Payment Time Indicated by the Order Is Not the Pick-up Time.，Pick-up Time Is Subject to the Received SMS，Remember to Take the SMS as the Standard。 \nIf You Are Satisfied with Us，Save Yourself the Trouble to a5Star Praise Oh！Finally, I Wish You a Happy Shopping Experience！\nThere Are Size Restrictions on Picking up Goods by Super Merchants，Buy Large Products，We Recommend That You Use the Home Delivery Method，Or Split Two Orders by Yours",
        "brand": null,
        "discount": "69%"
    },
    {
        "name": "(ready stock)Baseus Game Pad Trigger Mobile Phone Games Shooter Controller L1 R1 Fire Button Handle (1",
        "link": "https://shopee.sg/api/v2/item/get?itemid=11217751110&shopid=485218701",
        "org_price": "9.99-9.99",
        "new_price": "9.0-9.0",
        "desc": "FREE SHIPPING\n Hey~ Welcome to our store!!! Please read the product description clearly,choose u need.Most items have ready stocks! Enjoy~\n❥Package：\n1* 1Pair Gaming Trigger \n❥Description:\nBrand Name:BASEUS\nMaterial:ABS\nCharger:No\nCompatible Brand:Universal\nMagnetic:No\nModel Number:Baseus Gaming Trigger\nType:Game triggers\nMaterial:Metal+ABS\nPackage List:1 pair of game triggers (left + right)\nSuitable:for IOS Andriod Phones\nCompatible:For 4.0 -6.5 Inch Phones\nFeature 1:Game Fire Button Aim Key\nFeature 2:Shooting Game ControllerFunction:Mobile Phone Fire Button\nUsage:Games Shooter For PUBG/Rules of Survival/Knives Out\n#GamingTrigger #PhoneGamesShooterController #ShooterController #RulesofSurvival \n#ShootingGame  #baseus #Knive",
        "brand": null,
        "discount": "10%"
    }
]